org/articles/sutton.org
#+TITLE: Learning RL

* Sutton and Barto

I am anticipating needing to deeply understand Reinforcement Learning to properly do my job. Everybody says that [[http://incompleteideas.net/book/RLbook2020.pdf][this book]] is the way to do that, so I'm working through it and doing the exercises. I'll be putting the exercises in this document along with some random thoughts I may have. I have done this on here [[https://planetbanatt.net/articles/probmods.html][before, with the textbook Probabilistic Models of Cognition]], so it will largely be the same as that. I am also roughly following [[https://www.youtube.com/playlist?list=PLqYmG7hTraZBKeNJ-JE_eyJHZ7XgBoAyb][the DeepMind x UCL Reinforcement Learning Course (2018)]] which follows this book. I learn much better from reading and practicing compared to from watching and listening, but it doesn't hurt to attack the problem from all fronts.

I'll be checking my answers to the exercises with LLMs as I work through the book. The majority of these are near the beginning of the book (chapter 3 has almost 30 exercises, most chapters after have about 10, part III has one exercise total). Since my objective is to understand RL well enough to do research, I'm going to make a good faith effort to actually get through the whole book, including these less exercise-heavy chapters / ones not covered in the DeepMind course. We will see how well I stick to it, but I have some optimism. *Please Note: I give no guarantee of correctness for these exercises.* This is not an answer key, it's my attempt at fighting through a textbook to learn a new topic. 

Overall I have been finding this book to be very challenging. I really thought my programming background would help me a lot more than it has been, so struggling through the necessary notation has been pretty taxing. 

** Random Thoughts

This book is actually pretty surface level on deep RL so I'll probably need to read more papers for that. In particular I'm planning on reading through the code for [[https://docs.cleanrl.dev/][CleanRL]] and some important relevant papers on top of reading this book.

This book's full content is roughly 2 semesters worth of material. The one semester version stops at chapter 10.

Arcade culture as multi-arm bandit problem

Evolutionary RL with parameter model merging crossover operations

spybots clone might be good environment to implement algos like MCTS

Need to go back and cloze card all the summary sections after every chapter.

** Exercises

*** 1 - Introduction

/status: checked with o1-preview/

