articles/sutton.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-19 Sat 15:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learning RL</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="./css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="./favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Learning RL</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org171e715">Sutton and Barto</a>
<ul>
<li><a href="#orgd4dd495">Random Thoughts</a></li>
<li><a href="#orge2f50e4">Exercises</a>
<ul>
<li><a href="#org8d98f92">1 - Introduction</a>
<ul>
<li><a href="#org7215813">Exercise 1.1: Self-Play</a></li>
<li><a href="#org5c9fe40">Exercise 1.2: Symmetries</a></li>
<li><a href="#org7d3011a">Exercise 1.3: Greedy Play</a></li>
<li><a href="#orgebc8d95">Exercise 1.4: Learning from Exploration</a></li>
<li><a href="#orge6f3ea4">Exercise 1.5: Other Improvements</a></li>
</ul>
</li>
<li><a href="#orgbf03f23">2 - Multi-armed Bandits</a>
<ul>
<li><a href="#org3b132b1">Exercise 2.1</a></li>
<li><a href="#org0f67688">Exercise 2.2: Bandit example</a></li>
<li><a href="#org12fd895">Exercise 2.3</a></li>
<li><a href="#orge999ae2">Exercise 2.4</a></li>
<li><a href="#org9fe7478">Exercise 2.5 (programming)</a></li>
<li><a href="#org0c06fe0">Exercise 2.6: Mysterious Spikes</a></li>
<li><a href="#org1425d55">Exercise 2.7: Unbiased Constant-Step-Size Trick</a></li>
<li><a href="#orgffb4fb6">Exercise 2.8: UCB Spikes</a></li>
<li><a href="#org6b6be4b">Exercise 2.9</a></li>
<li><a href="#orgcb3280b">Exercise 2.10</a></li>
<li><a href="#org0cbb61e">Exercise 2.11 (programming)</a></li>
</ul>
</li>
<li><a href="#orgf52f46c">3 - Finite Markov Decision Processes</a>
<ul>
<li><a href="#org69c8238">Exercise 3.1</a></li>
<li><a href="#org1f629db">Exercise 3.2</a></li>
<li><a href="#org7f834ca">Exercise 3.3</a></li>
<li><a href="#orgc2d2955">Exercise 3.4</a></li>
<li><a href="#org9ccb848">Exercise 3.5</a></li>
<li><a href="#org95530bf">Exercise 3.7</a></li>
<li><a href="#orgc7ca337">Exercise 3.8</a></li>
<li><a href="#org6901e42">Exercise 3.9</a></li>
<li><a href="#orgc40e774">Exercise 3.10</a></li>
<li><a href="#orgc8b2f7c">Exercise 3.11</a></li>
<li><a href="#org37b5f22">Exercise 3.12</a></li>
<li><a href="#orgd20274e">Exercise 3.13</a></li>
<li><a href="#org51008ac">Exercise 3.14</a></li>
<li><a href="#orgebc80a5">Exercise 3.15</a></li>
<li><a href="#orgd0d2f03">Exercise 3.16</a></li>
<li><a href="#org0707de8">Exercise 3.17</a></li>
<li><a href="#org7e04c98">Exercise 3.18</a></li>
<li><a href="#orgcfd499f">Exercise 3.19</a></li>
<li><a href="#org885f668">Exercise 3.20</a></li>
<li><a href="#org30117a6">Exercise 3.21</a></li>
<li><a href="#org430be7a">Exercise 3.22</a></li>
<li><a href="#org41796cb">Exercise 3.23</a></li>
<li><a href="#orgfe05921">Exercise 3.24</a></li>
<li><a href="#orgcae5c74">Exercise 3.25</a></li>
<li><a href="#org8b7c1ef">Exercise 3.26</a></li>
<li><a href="#orgce0d19b">Exercise 3.27</a></li>
<li><a href="#org50fc3b3">Exercise 3.28</a></li>
<li><a href="#org8f5683d">Exercise 3.29</a></li>
</ul>
</li>
<li><a href="#org537478e">4 - Dynamic Programming</a>
<ul>
<li><a href="#org8ac6a43">Exercise 4.1</a></li>
<li><a href="#orge7bd185">Exercise 4.2</a></li>
<li><a href="#orga67e87d">Exercise 4.3</a></li>
<li><a href="#org976b9c4">Exercise 4.4</a></li>
<li><a href="#org625cf9d">Exercise 4.5</a></li>
<li><a href="#org63ff211">Exercise 4.6</a></li>
<li><a href="#orgf65ecef">Exercise 4.7 (programming)</a></li>
<li><a href="#org336d135">Exercise 4.8</a></li>
<li><a href="#org1d9ce9d">Exercise 4.9 (programming)</a></li>
<li><a href="#org09afd6b">Exercise 4.10</a></li>
</ul>
</li>
<li><a href="#orgab5852f"><span class="todo TODO">TODO</span> 5 - Monte Carlo Methods</a>
<ul>
<li><a href="#orgf022720">Exercise 5.1</a></li>
<li><a href="#org76f8917">Exercise 5.2</a></li>
<li><a href="#orgd561ab8">Exercise 5.3</a></li>
<li><a href="#orga08b617">Exercise 5.4</a></li>
<li><a href="#org145793e">Exercise 5.5</a></li>
<li><a href="#orgc501dc0">Exercise 5.6</a></li>
<li><a href="#orgac06e74">Exercise 5.7</a></li>
<li><a href="#org1985ddb">Exercise 5.8</a></li>
<li><a href="#org5d28e9a">Exercise 5.9</a></li>
<li><a href="#org398e44d">Exercise 5.10</a></li>
<li><a href="#org5c5472b">Exercise 5.11</a></li>
<li><a href="#orgfab7460"><span class="todo TODO">TODO</span> Exercise 5.12: Racetrack (programming)</a></li>
<li><a href="#org3f88144">Exercise 5.15</a></li>
<li><a href="#org9486461"><span class="todo TODO">TODO</span> Asterisked Exercises to Revisit Later</a></li>
</ul>
</li>
<li><a href="#org96ba0d4"><span class="todo TODO">TODO</span> 6 - Temporal-Difference Learning</a>
<ul>
<li><a href="#org7796fcd">Exercise 6.1</a></li>
<li><a href="#orga0e9387">Exercise 6.2</a></li>
<li><a href="#orgfbd9e1b">Exercise 6.3</a></li>
<li><a href="#org013b032">Exercise 6.4</a></li>
<li><a href="#org1405b97">Exercise 6.6</a></li>
<li><a href="#org7070018">Exercise 6.8</a></li>
<li><a href="#org46277dc"><span class="todo TODO">TODO</span> Exercise 6.9 (programming)</a></li>
<li><a href="#orgf474859"><span class="todo TODO">TODO</span> Exercise 6.10 (programming)</a></li>
<li><a href="#org35c1c9c">Exercise 6.11</a></li>
<li><a href="#org717b4ac">Exercise 6.12</a></li>
<li><a href="#org82dad7c">Exercise 6.14</a></li>
<li><a href="#orgb4698ae"><span class="todo TODO">TODO</span> Asterisked Exercises to Return To Later</a></li>
</ul>
</li>
<li><a href="#org068479b"><span class="todo TODO">TODO</span> 7 - n-step Bootstrapping</a>
<ul>
<li><a href="#org068c94f">Exercise 7.1</a></li>
<li><a href="#org804812f"><span class="todo TODO">TODO</span> Exercise 7.2 (programming)</a></li>
<li><a href="#org566cc49">Exercise 7.3</a></li>
<li><a href="#org57aef90">Exercise 7.4</a></li>
<li><a href="#orga652932">Exercise 7.11</a></li>
<li><a href="#orgb7752d7"><span class="todo TODO">TODO</span> Starred Exercises</a></li>
</ul>
</li>
<li><a href="#org688a1aa"><span class="todo TODO">TODO</span> 8 - Planning and Learning with Tabular Methods</a>
<ul>
<li><a href="#org00bd23a">Exercise 8.1</a></li>
<li><a href="#org714ccf6">Exercise 8.2</a></li>
<li><a href="#org3ffe98c">Exercise 8.3</a></li>
<li><a href="#org05ead35"><span class="todo TODO">TODO</span> Exercise 8.4 (programming)</a></li>
<li><a href="#orgebeb80a">Exercise 8.5</a></li>
<li><a href="#org83653df">Exercise 8.6</a></li>
<li><a href="#org2417be7">Exercise 8.7</a></li>
<li><a href="#org41b5b9f"><span class="todo TODO">TODO</span> Exercise 8.8 (programming)</a></li>
</ul>
</li>
<li><a href="#org4d87fb0">9 - On-policy Prediction with Approximation</a></li>
<li><a href="#org07b1967">10 - On-policy Control with Approximation</a></li>
<li><a href="#org1338b70">11 - *Off-policy Methods with Approximation</a></li>
<li><a href="#orgd91dc01">12 - Eligibility Traces</a></li>
<li><a href="#org4faa107">13 - Policy Gradient Methods</a></li>
<li><a href="#org0577026">14-16: No Exercises</a></li>
<li><a href="#orgee2c96c">17 - Frontiers</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org171e715" class="outline-1">
<h1 id="org171e715">Sutton and Barto</h1>
<div class="outline-text-1" id="text-org171e715">
<p>
I am anticipating needing to deeply understand Reinforcement Learning to properly do my job. Everybody says that <a href="http://incompleteideas.net/book/RLbook2020.pdf">this book</a> is the way to do that, so I'm working through it and doing the exercises. I'll be putting the exercises in this document along with some random thoughts I may have. I have done this on here <a href="https://planetbanatt.net/articles/probmods.html">before, with the textbook Probabilistic Models of Cognition</a>, so it will largely be the same as that. I am also roughly following <a href="https://www.youtube.com/playlist?list=PLqYmG7hTraZBKeNJ-JE_eyJHZ7XgBoAyb">the DeepMind x UCL Reinforcement Learning Course (2018)</a> which follows this book. I learn much better from reading and practicing compared to from watching and listening, but it doesn't hurt to attack the problem from all fronts.
</p>

<p>
I'll be checking my answers to the exercises with LLMs as I work through the book. The majority of these are near the beginning of the book (chapter 3 has almost 30 exercises, most chapters after have about 10, part III has one exercise total). Since my objective is to understand RL well enough to do research, I'm going to make a good faith effort to actually get through the whole book, including these less exercise-heavy chapters / ones not covered in the DeepMind course. We will see how well I stick to it, but I have some optimism. <b>Please Note: I give no guarantee of correctness for these exercises.</b> This is not an answer key, it's my attempt at fighting through a textbook to learn a new topic. 
</p>

<p>
Overall I have been finding this book to be very challenging. I really thought my programming background would help me a lot more than it has been, so struggling through the necessary notation has been pretty taxing. 
</p>
</div>

<div id="outline-container-orgd4dd495" class="outline-2">
<h2 id="orgd4dd495">Random Thoughts</h2>
<div class="outline-text-2" id="text-orgd4dd495">
<p>
This book is actually pretty surface level on deep RL so I'll probably need to read more papers for that. In particular I'm planning on reading through the code for <a href="https://docs.cleanrl.dev/">CleanRL</a> and some important relevant papers on top of reading this book.
</p>

<p>
This book's full content is roughly 2 semesters worth of material. The one semester version stops at chapter 10.
</p>

<p>
Arcade culture as multi-arm bandit problem
</p>

<p>
Evolutionary RL with parameter model merging crossover operations
</p>

<p>
spybots clone might be good environment to implement algos like MCTS
</p>

<p>
Need to go back and cloze card all the summary sections after every chapter.
</p>
</div>
</div>
