articles/sutton.html

<div id="outline-container-orge2f50e4" class="outline-2">
<h2 id="orge2f50e4">Exercises</h2>
<div class="outline-text-2" id="text-orge2f50e4">
</div>
<div id="outline-container-org8d98f92" class="outline-3">
<h3 id="org8d98f92">1 - Introduction</h3>
<div class="outline-text-3" id="text-org8d98f92">
<p>
<i>status: checked with o1-preview</i>
</p>
</div>

<div id="outline-container-org7215813" class="outline-4">
<h4 id="org7215813">Exercise 1.1: Self-Play</h4>
<div class="outline-text-4" id="text-org7215813">
<p>
Suppose, instead of playing against a random opponent, the
reinforcement learning algorithm described above played against itself, with both sides
learning. What do you think would happen in this case? Would it learn a different policy
for selecting moves?
</p>

<p>
I already know self-play already works for achieving high skill in RL tasks (see: alphago) but I do think it's possible for larger environments that policies learned through self-play to tunnel into behaviors which do not fully explore a very complex environment. I remember seeing some papers exploiting this by <a href="https://arxiv.org/pdf/2211.00241">learning adversarial policies</a> that win by creating out-of-distribution states. But for something simple like tic-tac-toe I doubt it would cause huge problems, in the limit both will explore the space completely. 
</p>
</div>
</div>

<div id="outline-container-org5c9fe40" class="outline-4">
<h4 id="org5c9fe40">Exercise 1.2: Symmetries</h4>
<div class="outline-text-4" id="text-org5c9fe40">
<p>
Many tic-tac-toe positions appear different but are really
the same because of symmetries. How might we amend the learning process described
above to take advantage of this? In what ways would this change improve the learning
process? Now think again. Suppose the opponent did not take advantage of symmetries.
In that case, should we? Is it true, then, that symmetrically equivalent positions should
necessarily have the same value?
</p>

<p>
We could take advantage of this via data augmentation in training, applying all the different rotations and mirrors to the game board and having 8 training examples instead of 1 per episode. This would make us equally strong from all angles, since we will have an equal balance of the different versions of the same positions. Taking advantage of the symmetries shouldn't have any different effects whether or not our opponent uses them or not &#x2013; they're literally identical states, and should have identical value functions as a result. One thing which may break this is if we learn that our opponent is worse at one particular rotation of the game board, and seeking to exploit that. If we do augmentation this way, we won't be able to learn that sort of thing, since we will be artificially improving their performance in those spots, but in exchange we get more training examples and better balance subject to symmetry.
</p>
</div>
</div>

<div id="outline-container-org7d3011a" class="outline-4">
<h4 id="org7d3011a">Exercise 1.3: Greedy Play</h4>
<div class="outline-text-4" id="text-org7d3011a">
<p>
Suppose the reinforcement learning player was greedy, that is,
it always played the move that brought it to the position that it rated the best. Might it
learn to play better, or worse, than a nongreedy player? What problems might occur?
</p>

<p>
If the player was greedy and never explored, that could lead to lots of problems where states get assigned incorrect value estimations. For example, if you have an action which causes +1 reward 90% of the time and -1 reward 10% of the time, and you happen to get -1 reward the first time you take that option, your estimation for that action is likely to be irrecoverably wrong. The purpose of non-greedy decisions is to make sure that your "rating the best" is actually accurate, since over time you'll get a better picture of more types of states that way. 
</p>
</div>
</div>

<div id="outline-container-orgebc8d95" class="outline-4">
<h4 id="orgebc8d95">Exercise 1.4: Learning from Exploration</h4>
<div class="outline-text-4" id="text-orgebc8d95">
<p>
Suppose learning updates occurred after all
moves, including exploratory moves. If the step-size parameter is appropriately reduced
over time (but not the tendency to explore), then the state values would converge to
a different set of probabilities. What (conceptually) are the two sets of probabilities
computed when we do, and when we do not, learn from exploratory moves? Assuming
that we do continue to make exploratory moves, which set of probabilities might be better
to learn? Which would result in more wins?
</p>

<p>
Consider a case where you have a state which is next to the goal state, and also next to a state which kills you. In the greedy case, you would love to be in this state, because then you can go to the goal state, and you'll get very high reward. But in the exploration-enabled case, this state is kind of risky because there's a change you'll decide to explore in this state, land in the death state, and recieve a big negative reward. If you learn after exploratory moves, you're learning the value of the state including that probability of randomly dying, whereas otherwise you aren't. If you want to keep doing this exploration, you might be better off using these probabilities, since avoiding death is pretty important, but if you plan on turning those moves off then there's no need to avoid this hypothetical state.
</p>
</div>
</div>

<div id="outline-container-orge6f3ea4" class="outline-4">
<h4 id="orge6f3ea4">Exercise 1.5: Other Improvements</h4>
<div class="outline-text-4" id="text-orge6f3ea4">
<p>
Can you think of other ways to improve the reinforcement learning player? Can you think of any better way to solve the tic-tac-toe problem as posed?
</p>

<p>
Arming the player with search seems like a good way to get better estimates of the current state.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbf03f23" class="outline-3">
<h3 id="orgbf03f23">2 - Multi-armed Bandits</h3>
<div class="outline-text-3" id="text-orgbf03f23">
<p>
<i>status: checked with o1-preview, need to fix 2.7 because code is not the correct deliverable</i>
</p>
</div>

<div id="outline-container-org3b132b1" class="outline-4">
<h4 id="org3b132b1">Exercise 2.1</h4>
<div class="outline-text-4" id="text-org3b132b1">
<p>
In &epsilon; -greedy action selection, for the case of two actions and &epsilon; = 0.5, what is
the probability that the greedy action is selected?
</p>

<p>
.75 (from greedy 0.5, from random 0.5 / 2) 
</p>
</div>
</div>

<div id="outline-container-org0f67688" class="outline-4">
<h4 id="org0f67688">Exercise 2.2: Bandit example</h4>
<div class="outline-text-4" id="text-org0f67688">
<p>
Consider a k-armed bandit problem with k = 4 actions,
denoted 1, 2, 3, and 4. Consider applying to this problem a bandit algorithm using
"-greedy action selection, sample-average action-value estimates, and initial estimates
of Q1(a) = 0, for all a. Suppose the initial sequence of actions and rewards is A1 = 1,
R1 = 1, A2 = 2, R2 = 1, A3 = 2, R3 = 2, A4 = 2, R4 = 2, A5 = 3, R5 = 0. On some
of these time steps the " case may have occurred, causing an action to be selected at
random. On which time steps did this definitely occur? On which time steps could this
possibly have occurred? ⇤
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Step</th>
<th scope="col" class="org-right">Action</th>
<th scope="col" class="org-right">Reward</th>
<th scope="col" class="org-left">Greedy ?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">Maybe (all 0)</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-left">No (A1 has 1)</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-left">Maybe (A1 and A2 both with 1)</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-left">Maybe (A2 clearly best now but can still be selected by exploration)</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">3</td>
<td class="org-right">0</td>
<td class="org-left">No (No info on 3 at all)</td>
</tr>
</tbody>
</table>
</div>
</div>
