org/articles/sutton.org
**** Exercise 2.3

In the comparison shown in Figure 2.2, which method will perform best in
the long run in terms of cumulative reward and probability of selecting the best action?
How much better will it be? Express your answer quantitatively.

In the long run. \eps = 0.01 will perform best. \eps = 0.1 learns the
optimal action the fastest, but is bottlenecked by the fact that it
must select a random action 10% of the time, meaning it gets optimal
reward 91% of the time. In comparison, once \eps = 0.01 learns the
optimal action, it will pick that option 99.5% of the time. You can
observe this in the slopes of the figure, where 0.01 is initially
lower but continues to grow.

**** Exercise 2.4

If the step-size parameters, \alpha_n, are not constant, then the estimate Qn is
a weighted average of previously received rewards with a weighting different from that
given by (2.6). What is the weighting on each prior reward for the general case, analogous
to (2.6), in terms of the sequence of step-size parameters? ⇤

If you expand out the terms you'll get:

Q_{n+1} = a_1 R_n + (1 - a_1)(a_2 R_{n-1} + (1 - a_2)(a_3 R_{n-2} + (1 - a_3)(Q_{n-3})))

etc

if we try to break it apart we get

Q_{n+1} = a_1 R_n + (1 - a_1)(a_2 R_{n-1}) + (1 - a_1)(1 - a_2)(a_3 R_{n-2}) + (1-a_1)(1-a_2)(1 - a_3)(Q_{n-3})))

suggesting that in the general case we arrive at a form that looks like this:

W_{n+1} = \Prod{i=1}{n} (1 - a_i) (a_n R_{n})

I think I likely have the notation wrong here but visually it makes sense.

/o1-preview: $Q_{n+1} = \sum_{k=1}^{n}(\alpha_k \prod_{i=k+1}^{n}(1-\alpha_i))R_k$/ 

**** Exercise 2.5 (programming)

Design and conduct an experiment to demonstrate the
diculties that sample-average methods have for nonstationary problems. Use a modified
version of the 10-armed testbed in which all the q_*(a) start out equal and then take
independent random walks (say by adding a normally distributed increment with mean 0
and standard deviation 0.01 to all the q⇤(a) on each step). Prepare plots like Figure 2.2
for an action-value method using sample averages, incrementally computed, and another
action-value method using a constant step-size parameter, \alpha = 0.1. Use \epsilon = 0.1 and
longer runs, say of 10,000 steps

#+BEGIN_SRC python
import numpy as np
import matplotlib.pyplot as plt

# define k armed bandit
k = 10
q_stars = [5 for _ in range(k)]

def run_experiment(epsilon, method='constant'):

    num_acts = [0 for _ in q_stars]
    q_vals = [0 for _ in q_stars]

    if method == 'constant':
        alpha = 0.1

    steps = 10000

    avg_rewards = []
    pct_optimals = []
    avg_reward = 0
    optimal_actions = 0

    for step in range(steps):
        if method != 'constant':
            alpha = 1 / (step + 1)

        # random walks
        for i, bandit in enumerate(q_stars):
            q_stars[i] += np.random.normal(0, 0.01)

        # epsilon-greedy
        if np.random.random() < epsilon:
            act = np.random.randint(0, k)
        else:
            act = np.argmax(q_vals)

        num_acts[act] += 1
        q_vals[act] += alpha * (q_stars[act] - q_vals[act])

        avg_reward += (1 / (step + 1)) * q_stars[act]
        avg_rewards.append(avg_reward)

        if act == np.argmax(q_stars):
            optimal_actions += 1

        pct_optimal = optimal_actions / (step + 1)
        pct_optimals.append(pct_optimal)

    return avg_rewards, pct_optimals

const_rewards, const_optimals = run_experiment(0.1, method='constant')
avg_rewards, avg_optimals = run_experiment(0.1, method='average')

plt.title("Average rewards")
plt.plot(const_rewards, label='constant alpha')
plt.plot(avg_rewards, label='averaging')
plt.legend()
plt.show()

plt.title("Optimal actions")
plt.plot(const_optimals, label='constant alpha')
plt.plot(avg_optimals, label='averaging')
plt.legend()
plt.show()
#+END_SRC

**** Exercise 2.6: Mysterious Spikes

The results shown in Figure 2.3 should be quite reliable
because they are averages over 2000 individual, randomly chosen 10-armed bandit tasks.
Why, then, are there oscillations and spikes in the early part of the curve for the optimistic
method? In other words, what might make this method perform particularly better or
worse, on average, on particular early steps? ⇤

If the rewards are optimistic, it's very likely that you will pull all the levers once after only a few turns, since you'll be disappointed each time. You should then get a good picture of the best one very quickly, which means you should pick the best option very often very early on. However, you run into a problem -- greedily picking that option will make your estimate of that state worse, so by picking it you temporarily make it less likely to be selected again. This will continue until the estimates are accurate enough for selecting the best option to not make the estimate worse than the estimates for the other options.

