articles/sutton.html

<div id="outline-container-org1425d55" class="outline-4">
<h4 id="org1425d55">Exercise 2.7: Unbiased Constant-Step-Size Trick</h4>
<div class="outline-text-4" id="text-org1425d55">
<p>
In most of this chapter we have used
sample averages to estimate action values because sample averages do not produce the
initial bias that constant step sizes do (see the analysis leading to (2.6)). However, sample
averages are not a completely satisfactory solution because they may perform poorly
on nonstationary problems. Is it possible to avoid the bias of constant step sizes while
retaining their advantages on nonstationary problems? One way is to use a step size of
</p>

<p>
\(\beta_n \doteq \alpha / \bar{o}_n\)
</p>

<p>
to process the nth reward for a particular action, where &alpha; &gt; 0 is a conventional constant
step size, and ¯on is a trace of one that starts at 0:
</p>

<p>
\(\bar{o}_n \doteq \bar{o}_{n-1} + \alpha (1 - \bar{p}_{n-1}) \text{ for } n > 0, \text{ with } \bar{o}_0 \doteq 0\).
</p>

<p>
Carry out an analysis like that in (2.6) to show that Qn is an exponential recency-weighted
average without initial bias.
</p>

<div class="org-src-container">
<pre class="src src-python">import numpy as np
import matplotlib.pyplot as plt

# define k armed bandit
k = 10
q_stars = [np.random.normal(0, 1) for _ in range(k)]

def run_experiment(epsilon, method='constant'):

    num_acts = [0 for _ in q_stars]
    q_vals = [5 for _ in q_stars] #optimistic reward

    if method == 'constant':
	alpha = 0.1
	o_bar = 0

    steps = 10000

    avg_rewards = []
    pct_optimals = []
    avg_reward = 0
    optimal_actions = 0

    for step in range(steps):
	if method == 'constant':
	    o_bar += alpha * (1 - o_bar)
	    beta = alpha / o_bar
	else:
	    beta = 1 / (step + 1)

	# epsilon-greedy
	if np.random.random() &lt; epsilon:
	    act = np.random.randint(0, k)
	else:
	    act = np.argmax(q_vals)

	num_acts[act] += 1
	q_vals[act] += beta * (q_stars[act] - q_vals[act])

	avg_reward += (1 / (step + 1)) * q_stars[act]
	avg_rewards.append(avg_reward)

	if act == np.argmax(q_stars):
	    optimal_actions += 1

	pct_optimal = optimal_actions / (step + 1)
	pct_optimals.append(pct_optimal)

    return avg_rewards, pct_optimals

const_rewards, const_optimals = run_experiment(0.1, method='constant')
avg_rewards, avg_optimals = run_experiment(0.1, method='average')

plt.title("Average rewards")
plt.plot(const_rewards, label='constant alpha')
plt.plot(avg_rewards, label='averaging')
plt.legend()
plt.show()

plt.title("Optimal actions")
plt.plot(const_optimals, label='constant alpha')
plt.plot(avg_optimals, label='averaging')
plt.legend()
plt.show()
</pre>
</div>

<p>
<i>TODO: I think this question requires me to show that the weights sum to 1, not to implement it</i>
</p>
</div>
</div>

<div id="outline-container-orgffb4fb6" class="outline-4">
<h4 id="orgffb4fb6">Exercise 2.8: UCB Spikes</h4>
<div class="outline-text-4" id="text-orgffb4fb6">
<p>
In Figure 2.4 the UCB algorithm shows a distinct spike
in performance on the 11th step. Why is this? Note that for your answer to be fully
satisfactory it must explain both why the reward increases on the 11th step and why it
decreases on the subsequent steps. Hint: If c = 1, then the spike is less prominent. ⇤
</p>

<p>
If you have 10 bandits after only a few trials, the UCB term will likely dominate for untested bandits, so it will test all the bandits once each in the first ten trials. On the 11th trial, all of the UCB terms will be equal, so it's very likely to pull the bandit which returned the highest value, which is most often the optimal one. However, once you do that, you reduce the UCB term for that bandit, which means that you'll start wanting to pull the other bandits again. This will repeat until the UCB term goes to ~0 after many trials. When c=1, this term is less dominating, so it becomes more possible to select two bandits twice in the first 10 trials, which would diffuse this spike to adjacent timesteps.
</p>
</div>
</div>

<div id="outline-container-org6b6be4b" class="outline-4">
<h4 id="org6b6be4b">Exercise 2.9</h4>
<div class="outline-text-4" id="text-org6b6be4b">
<p>
Show that in the case of two actions, the soft-max distribution is the same
as that given by the logistic, or sigmoid, function often used in statistics and artificial
neural networks.
</p>

<p>
with two actions we have
</p>

<p>
e<sup>z<sub>i</sub></sup> / &sum;{j=1}{K} e<sup>z<sub>j</sub></sup>
</p>

<p>
e<sup>z<sub>i</sub></sup> / (e<sup>z<sub>1</sub></sup> + e<sup>z<sub>2</sub></sup>)
</p>

<p>
p(1) + p(2) = 1
</p>

<p>
p(1) = e<sup>z<sub>1</sub></sup> / (e<sup>z<sub>1</sub></sup> + e<sup>z<sub>2</sub></sup>)
</p>

<p>
dividing numerator and denomenator by e<sup>z</sup><sub>2</sub> is equivalent to subtraction
</p>

<p>
p(1) = e<sup>z<sub>1</sub> - z<sub>2</sub></sup> / (e<sup>z<sub>1</sub> - z<sub>2</sub></sup> + e<sup>z<sub>2</sub> - z<sub>2</sub></sup>)
</p>

<p>
p(1) = e<sup>z<sub>1</sub> - z<sub>2</sub></sup> / (1 + e<sup>z<sub>1</sub> - z<sub>2</sub></sup>)
</p>

<p>
if x = z<sub>1</sub> - z<sub>2</sub> we now have
</p>

<p>
e<sup>x</sup> / (1 + e<sup>x</sup>)
</p>

<p>
which is the sigmoid
</p>
</div>
</div>

<div id="outline-container-orgcb3280b" class="outline-4">
<h4 id="orgcb3280b">Exercise 2.10</h4>
<div class="outline-text-4" id="text-orgcb3280b">
<p>
Suppose you face a 2-armed bandit task whose true action values change
randomly from time step to time step. Specifically, suppose that, for any time step,
the true values of actions 1 and 2 are respectively 10 and 20 with probability 0.5 (case
A), and 90 and 80 with probability 0.5 (case B). If you are not able to tell which case
you face at any step, what is the best expected reward you can achieve and how should
you behave to achieve it? Now suppose that on each step you are told whether you are
facing case A or case B (although you still don’t know the true action values). This is an
associative search task. What is the best expected reward you can achieve in this task,
and how should you behave to achieve it?
</p>

<p>
If you don't know the state, you do the same on both cases. picking action A will give you (10 + 90)/2 = 50 and action B will give you (20 + 80)/2 = 50 on average, so you can't do better than random. If you know what state you're in, you will want to select 2 in case A and 1 in case B, which will give you (20 + 90) / 2 = 55 average reward. Once you know the state, you collapse to the normal learning problem in a k-armed bandit, so any of those methods would work once you know the underlying state. 
</p>
</div>
</div>
