org/articles/sutton.org
**** Exercise 2.11 (programming)

Make a figure analogous to Figure 2.6 for the nonstationary
case outlined in Exercise 2.5. Include the constant-step-size \epsilon-greedy algorithm with
\alpha = 0.1. Use runs of 200,000 steps and, as a performance measure for each algorithm and
parameter setting, use the average reward over the last 100,000 steps.

#+BEGIN_SRC python
import numpy as np
import matplotlib.pyplot as plt

# define k armed bandit
k = 10
q_stars = [np.random.normal(0, 1) for _ in range(k)]

def run_experiment(epsilon, method='constant'):

    num_acts = [0 for _ in q_stars]

    if method == 'optimistic':
        q_vals = [5 for _ in q_stars]
    else:
        q_vals = [0 for _ in q_stars]

    #do they want the unbiased one?
    if method == 'constant' or method == 'optimistic': 
        alpha = 0.1
        o_bar = 0

    steps = 200000

    avg_rewards = []
    pct_optimals = []
    avg_reward = 0
    optimal_actions = 0

    for step in range(steps):
        if method == 'constant' or method == 'optimistic':
            o_bar += alpha * (1 - o_bar)
            beta = alpha / o_bar
        else:
            beta = 1 / (step + 1)

        # epsilon-greedy
        if method != 'ucb' and np.random.random() < epsilon:
            act = np.random.randint(0, k)
        elif method == 'ucb':
            ucbs = [q_vals[i] + np.sqrt(epsilon * np.log(step+1) / \
                                        num_acts[i]) for i in range(k)]
            act = np.argmax(ucbs)
        else:
            act = np.argmax(q_vals)

        num_acts[act] += 1
        q_vals[act] += beta * (q_stars[act] - q_vals[act])

        avg_reward += (1 / (step + 1)) * q_stars[act]
        avg_rewards.append(avg_reward)

        if act == np.argmax(q_stars):
            optimal_actions += 1

        pct_optimal = optimal_actions / (step + 1)
        pct_optimals.append(pct_optimal)

    return np.mean(avg_rewards[:100000])


vals = [1/128, 1/64, 1/32, 1/16, 1/8, 1/4, 1/2, 1, 2, 4]

const_rewards = [run_experiment(x, method='constant') for x in vals]
optimistic_rewards = [run_experiment(x, method='optimistic') for x in vals]
ucb_rewards = [run_experiment(x, method='ucb') for x in vals]

plt.title("Parameter Study")
plt.plot(vals, const_rewards, label='eps-greedy')
plt.plot(vals, optimistic_rewards, label='optimistic eps-greedy')
plt.plot(vals, ucb_rewards, label='UCB')
plt.xlabel("epsilon")
plt.ylabel("Average reward over last 100k steps")
plt.legend()
plt.show()
#+END_SRC

*** 3 - Finite Markov Decision Processes

/status: kinda rocky, but checked with o1-preview/

**** Exercise 3.1

Devise three example tasks of your own that fit into the MDP framework,
identifying for each its states, actions, and rewards. Make the three examples as different
from each other as possible. The framework is abstract and flexible and can be applied in
many different ways. Stretch its limits in some way in at least one of your examples. ⇤

1. Chess can be framed as an MDP, where each state is a board position, each action is the legal moves you can perform in that position, and each reward is the relative value of the position (or just 1 for goal state and -1 for loss state)

2. Flirting with someone can be framed as an MDP, where each state is the current point in a conversation, each action is what you can say at that point, and the reward is how much you observe they're into what you're saying (can be negative, for example if you start talking about how flirting is a Markov Decision Process)

3. Doing the exercises in Sutton and Barto can be framed as an MDP. Each state is your current location in the textbook, each action is your letter by letter solving of the problem (e.g. you write answers one letter at a time), and each reward is the feedback from a teacher or LLM about how well you solved an exercise.   

**** Exercise 3.2

Is the MDP framework adequate to usefully represent all goal-directed
learning tasks? Can you think of any clear exceptions? ⇤

Maybe not usefully; a big component of this is that MDPs have the markov property (where the past sequence of events is priced into the current state, and two identical "states" which would have different local behaviors based on the path required to reach them would get represented as different states). It's possible there are MDPs it's hard to represent the state as being independent of / inclusive of the entire history prior (i.e. it is possible, but the state space is so large that the dynamics can't be learned well). [[https://en.wikipedia.org/wiki/AlphaStar_(software)][Starcraft]] might be one of these? They struggled to reach superhuman play under human constraints and had to rely on imitation learning due to the overly large state space, due to the "exploration problem". 

**** Exercise 3.3

Consider the problem of driving. You could define the actions in terms of
the accelerator, steering wheel, and brake, that is, where your body meets the machine.
Or you could define them farther out—say, where the rubber meets the road, considering
your actions to be tire torques. Or you could define them farther in—say, where your
brain meets your body, the actions being muscle twitches to control your limbs. Or you
could go to a really high level and say that your actions are your choices of where to drive.
What is the right level, the right place to draw the line between agent and environment?
On what basis is one location of the line to be preferred over another? Is there any
fundamental reason for preferring one location over another, or is it a free choice? ⇤

I imagine your framing matters a lot here. If you want to build a system which outperforms humans at driving, you'll likely be interested in defining it at the machine level (unless you were building a humanoid robot which drives) because in that case you're able to directly actuate the pedals and stuff. If you're building a gps navigation service which arrives at a location while avoiding the most traffic, you don't actually care about the machine at all. If you're drunk at a bar, you hopefully would carefully consider that your body's condition introduces an additional level of uncertainty to your observations and actions, even though your car in the parking lot didn't change at all. It's not so much that it's a free choice, rather that it depends on the type of problem you are attempting to solve with your agent.

