org/articles/sutton.org
**** Exercise 3.4

Give a table analogous to that in Example 3.3, but for p(s', r|s, a). It
should have columns for s, a, s', r, and p(s', r|s, a), and a row for every 4-tuple for which
p(s', r|s, a) > 0.

| s    | a        | s'   | r        | p(s' / s, a) | p(s', r / s, a)                    |
|------+----------+------+----------+--------------+------------------------------------|
| high | search   | high | r_search | \alpha       | \alpha * p(r = R / s, a, s')       |
| high | search   | low  | r_search | 1 - \alpha   | (1 - \alpha) * p(r = R / s, a, s') |
| low  | search   | high | -3       | 1 - \beta    | (1 - \beta) * p(r = R / s, a, s')  |
| low  | search   | low  | r_search | \beta        | \beta * p(r = R / s, a, s')        |
| high | wait     | high | r_wait   | 1            | 1 * p(r = R / s, a, s')            |
| low  | wait     | low  | r_wait   | 1            | 1 * p(r = R / s, a, s')            |
| low  | recharge | high | 0        | 1            | 1 * p(r = R / s, a, s')            |

I am a bit confused by this because it doesn't look like there's anything about the probability of a specific reward, but I guess in concept it should be this right? 

**** Exercise 3.5

The equations in Section 3.1 are for the continuing case and need to be
modified (very slightly) to apply to episodic tasks. Show that you know the modifications
needed by giving the modified version of (3.3).

continuing case:

$\sum_{s' \in S} \sum_{r \in R} p(s', r | s, a) = 1 \text{ for all } s \in S, a \in A(s)$

episodic case:

$\sum_{s' \in S \cup T} \sum_{r \in R} p(s', r | s, a) = 1 \text{ for all } s \in S, a \in A(s) \text{ where T is the set of terminal states }$

Exercise 3.6 Suppose you treated pole-balancing as an episodic task but also used
discounting, with all rewards zero except for -1 upon failure. What then would the
return be at each time? How does this return differ from that in the discounted, continuing
formulation of this task? ⇤

$G_t = \sum_{k=0}^{T} \gamma^k R_{t+k+1}$

Since R is always 0 except at the terminal state, we can just write this simply as

$G_t = -\gamma^T$

This differs from the discounted, continuing formulation of this task because the reward in the continuous case the model will get negative reward every time it's not balancing, but if it falls it can right itself again to resume having no penalty. In the episodic case, it will just reset so that you start again, and you're directly maximizing the time to first failure rather than the minimum number of failures as late as possible.

**** Exercise 3.7

Imagine that you are designing a robot to run a maze. You decide to give it a
reward of +1 for escaping from the maze and a reward of zero at all other times. The task
seems to break down naturally into episodes—the successive runs through the maze—so
you decide to treat it as an episodic task, where the goal is to maximize expected total
reward (3.7). After running the learning agent for a while, you find that it is showing
no improvement in escaping from the maze. What is going wrong? Have you effectively
communicated to the agent what you want it to achieve? ⇤

If you do this, the agent will try to get out of the maze eventually, with no rush at all for how long that takes. As a result, with a long enough time horizon, taking enough random actions will eventually reach the terminal state, and all trials will have the same reward (+1). You aren't making it learn the maze, you're just asking it to exist until the terminal state is reached, and then rewarding it. What you would prefer is punishing -1 for every time step, so that the agent is rewarded for getting out faster, which will incentivize it to actually learn to escape the maze. 

**** Exercise 3.8

Suppose \gamma = 0.5 and the following sequence of rewards is received R1 = 1,
R2 = 2, R3 = 6, R4 = 3, and R5 = 2, with T = 5. What are G0, G1, ..., G5? Hint:
Work backwards. ⇤

G_0 = r_1 + \gamma G_{1}
G_1 = r_2 + \gamma G_{2}
G_2 = r_3 + \gamma G_{3}
G_3 = r_4 + \gamma G_{4}
G_4 = r_5 + \gamma G_{5}
G_5 = 0

G_4 = 2 + 0 = 2
G_3 = 3 + 0.5 * 2 = 4
G_2 = 6 + 0.5 * 4 = 8
G_1 = 2 + 0.5 * 8 = 6
G_0 = 1 + 0.5 * 6 = 4

**** Exercise 3.9

Suppose \gamma = 0.9 and the reward sequence is R1 = 2 followed by an infinite
sequence of 7s. What are G1 and G0? ⇤

$G_1 = 7 + \gamma G_2$

$G_2 = 7 \sum_{k=0}^{\infty} \gamma^k = \frac{7}{1 - \gamma} = 70$

$G_1 = 7 + 0.9*70 = 70$

$G_0 = 2 + 0.9*70 = 65$

**** Exercise 3.10

Prove the second equality in (3.10). ⇤

$G_0 = \sum_{k=0}^{\infty} \gamma^k$ is the geometric series.

$G_0 = \gamma^0 + \gamma^1 + \gamma^2 + \gamma^3 + ... + \gamma^\infty$

$G_0 = 1 + \gamma (1 + \gamma + \gamma^2 + ... + \gamma^\infty)$

$G_0 = 1 + \gamma G_0$

$G_0 = 1 + \gamma G_0$

$G_0 - \gamma G_0 = 1$

$G_0 (1 - \gamma) = 1$

$G_0 = 1 / (1 - \gamma)$

**** Exercise 3.11

If the current state is St, and actions are selected according to a stochastic
policy \pi, then what is the expectation of Rt+1 in terms of \pi and the four-argument
function p (3.2)? ⇤

Framing this as an expectation means we need to sum across all possible actions

$\sum_{a} \pi(a | S_t) \sum_{s', r} r * p(r| s', a)$

**** Exercise 3.12

Give an equation for v⇡ in terms of q⇡ and \pi. ⇤

$v_\pi(s) \doteq E_\pi[G_t | S_t = s]$

$q_\pi(s, a) \doteq E_\pi[G_t | S_t = s, A_t = a]$

---

To write in terms of q we just need to marginalize over all actions

$v_\pi(s) \doteq \sum_{a} \pi(a|s) E_\pi[G_t | S_t = s, A_t = a]$

that last term is the same as q

$v_\pi(s) \doteq \sum_{a} \pi(a|s) q_\pi(s, a)$

**** Exercise 3.13

Give an equation for q⇡ in terms of v⇡ and the four-argument p. ⇤

$q_\pi(s, a) \doteq E_\pi[G_t | S_t = s, A_t = a]$

Expanding out G_t

$q_\pi(s, a) \doteq E_\pi[R_{t+1} + \gamma G_{t+1} | S_t = s, A_t = a]$

Now we can condition on the next state to get v

$q_\pi(s, a) \doteq E_\pi[R_{t+1} + \gamma E[G_{t+1} | S_{t+1}] | S_t = s, A_t = a]$

$q_\pi(s, a) \doteq E_\pi[R_{t+1} + \gamma v_\pi(S_{t+1}) | S_t = s, A_t = a]$

and now since we have something with the shape (s', r | s, a) we can undo the expectation using the 4 argument p

$q_\pi(s, a) \doteq \sum_{s'} \sum_{r} p(s', r | s, a) * [r + \gamma v_\pi(s')]$

