articles/sutton.html

<div id="outline-container-orgc2d2955" class="outline-4">
<h4 id="orgc2d2955">Exercise 3.4</h4>
<div class="outline-text-4" id="text-orgc2d2955">
<p>
Give a table analogous to that in Example 3.3, but for p(s', r|s, a). It
should have columns for s, a, s', r, and p(s', r|s, a), and a row for every 4-tuple for which
p(s', r|s, a) &gt; 0.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">s</th>
<th scope="col" class="org-left">a</th>
<th scope="col" class="org-left">s'</th>
<th scope="col" class="org-left">r</th>
<th scope="col" class="org-left">p(s' / s, a)</th>
<th scope="col" class="org-left">p(s', r / s, a)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">high</td>
<td class="org-left">search</td>
<td class="org-left">high</td>
<td class="org-left">r<sub>search</sub></td>
<td class="org-left">&alpha;</td>
<td class="org-left">&alpha; * p(r = R / s, a, s')</td>
</tr>

<tr>
<td class="org-left">high</td>
<td class="org-left">search</td>
<td class="org-left">low</td>
<td class="org-left">r<sub>search</sub></td>
<td class="org-left">1 - &alpha;</td>
<td class="org-left">(1 - &alpha;) * p(r = R / s, a, s')</td>
</tr>

<tr>
<td class="org-left">low</td>
<td class="org-left">search</td>
<td class="org-left">high</td>
<td class="org-left">-3</td>
<td class="org-left">1 - &beta;</td>
<td class="org-left">(1 - &beta;) * p(r = R / s, a, s')</td>
</tr>

<tr>
<td class="org-left">low</td>
<td class="org-left">search</td>
<td class="org-left">low</td>
<td class="org-left">r<sub>search</sub></td>
<td class="org-left">&beta;</td>
<td class="org-left">&beta; * p(r = R / s, a, s')</td>
</tr>

<tr>
<td class="org-left">high</td>
<td class="org-left">wait</td>
<td class="org-left">high</td>
<td class="org-left">r<sub>wait</sub></td>
<td class="org-left">1</td>
<td class="org-left">1 * p(r = R / s, a, s')</td>
</tr>

<tr>
<td class="org-left">low</td>
<td class="org-left">wait</td>
<td class="org-left">low</td>
<td class="org-left">r<sub>wait</sub></td>
<td class="org-left">1</td>
<td class="org-left">1 * p(r = R / s, a, s')</td>
</tr>

<tr>
<td class="org-left">low</td>
<td class="org-left">recharge</td>
<td class="org-left">high</td>
<td class="org-left">0</td>
<td class="org-left">1</td>
<td class="org-left">1 * p(r = R / s, a, s')</td>
</tr>
</tbody>
</table>

<p>
I am a bit confused by this because it doesn't look like there's anything about the probability of a specific reward, but I guess in concept it should be this right? 
</p>
</div>
</div>

<div id="outline-container-org9ccb848" class="outline-4">
<h4 id="org9ccb848">Exercise 3.5</h4>
<div class="outline-text-4" id="text-org9ccb848">
<p>
The equations in Section 3.1 are for the continuing case and need to be
modified (very slightly) to apply to episodic tasks. Show that you know the modifications
needed by giving the modified version of (3.3).
</p>

<p>
continuing case:
</p>

<p>
\(\sum_{s' \in S} \sum_{r \in R} p(s', r | s, a) = 1 \text{ for all } s \in S, a \in A(s)\)
</p>

<p>
episodic case:
</p>

<p>
\(\sum_{s' \in S \cup T} \sum_{r \in R} p(s', r | s, a) = 1 \text{ for all } s \in S, a \in A(s) \text{ where T is the set of terminal states }\)
</p>

<p>
Exercise 3.6 Suppose you treated pole-balancing as an episodic task but also used
discounting, with all rewards zero except for -1 upon failure. What then would the
return be at each time? How does this return differ from that in the discounted, continuing
formulation of this task? ⇤
</p>

<p>
\(G_t = \sum_{k=0}^{T} \gamma^k R_{t+k+1}\)
</p>

<p>
Since R is always 0 except at the terminal state, we can just write this simply as
</p>

<p>
\(G_t = -\gamma^T\)
</p>

<p>
This differs from the discounted, continuing formulation of this task because the reward in the continuous case the model will get negative reward every time it's not balancing, but if it falls it can right itself again to resume having no penalty. In the episodic case, it will just reset so that you start again, and you're directly maximizing the time to first failure rather than the minimum number of failures as late as possible.
</p>
</div>
</div>

<div id="outline-container-org95530bf" class="outline-4">
<h4 id="org95530bf">Exercise 3.7</h4>
<div class="outline-text-4" id="text-org95530bf">
<p>
Imagine that you are designing a robot to run a maze. You decide to give it a
reward of +1 for escaping from the maze and a reward of zero at all other times. The task
seems to break down naturally into episodes—the successive runs through the maze—so
you decide to treat it as an episodic task, where the goal is to maximize expected total
reward (3.7). After running the learning agent for a while, you find that it is showing
no improvement in escaping from the maze. What is going wrong? Have you effectively
communicated to the agent what you want it to achieve? ⇤
</p>

<p>
If you do this, the agent will try to get out of the maze eventually, with no rush at all for how long that takes. As a result, with a long enough time horizon, taking enough random actions will eventually reach the terminal state, and all trials will have the same reward (+1). You aren't making it learn the maze, you're just asking it to exist until the terminal state is reached, and then rewarding it. What you would prefer is punishing -1 for every time step, so that the agent is rewarded for getting out faster, which will incentivize it to actually learn to escape the maze. 
</p>
</div>
</div>

<div id="outline-container-orgc7ca337" class="outline-4">
<h4 id="orgc7ca337">Exercise 3.8</h4>
<div class="outline-text-4" id="text-orgc7ca337">
<p>
Suppose &gamma; = 0.5 and the following sequence of rewards is received R1 = 1,
R2 = 2, R3 = 6, R4 = 3, and R5 = 2, with T = 5. What are G0, G1, &#x2026;, G5? Hint:
Work backwards. ⇤
</p>

<p>
G<sub>0</sub> = r<sub>1</sub> + &gamma; G<sub>1</sub>
G<sub>1</sub> = r<sub>2</sub> + &gamma; G<sub>2</sub>
G<sub>2</sub> = r<sub>3</sub> + &gamma; G<sub>3</sub>
G<sub>3</sub> = r<sub>4</sub> + &gamma; G<sub>4</sub>
G<sub>4</sub> = r<sub>5</sub> + &gamma; G<sub>5</sub>
G<sub>5</sub> = 0
</p>

<p>
G<sub>4</sub> = 2 + 0 = 2
G<sub>3</sub> = 3 + 0.5 * 2 = 4
G<sub>2</sub> = 6 + 0.5 * 4 = 8
G<sub>1</sub> = 2 + 0.5 * 8 = 6
G<sub>0</sub> = 1 + 0.5 * 6 = 4
</p>
</div>
</div>

<div id="outline-container-org6901e42" class="outline-4">
<h4 id="org6901e42">Exercise 3.9</h4>
<div class="outline-text-4" id="text-org6901e42">
<p>
Suppose &gamma; = 0.9 and the reward sequence is R1 = 2 followed by an infinite
sequence of 7s. What are G1 and G0? ⇤
</p>

<p>
\(G_1 = 7 + \gamma G_2\)
</p>

<p>
\(G_2 = 7 \sum_{k=0}^{\infty} \gamma^k = \frac{7}{1 - \gamma} = 70\)
</p>

<p>
\(G_1 = 7 + 0.9*70 = 70\)
</p>

<p>
\(G_0 = 2 + 0.9*70 = 65\)
</p>
</div>
</div>

<div id="outline-container-orgc40e774" class="outline-4">
<h4 id="orgc40e774">Exercise 3.10</h4>
<div class="outline-text-4" id="text-orgc40e774">
<p>
Prove the second equality in (3.10). ⇤
</p>

<p>
\(G_0 = \sum_{k=0}^{\infty} \gamma^k\) is the geometric series.
</p>

<p>
\(G_0 = \gamma^0 + \gamma^1 + \gamma^2 + \gamma^3 + ... + \gamma^\infty\)
</p>

<p>
\(G_0 = 1 + \gamma (1 + \gamma + \gamma^2 + ... + \gamma^\infty)\)
</p>

<p>
\(G_0 = 1 + \gamma G_0\)
</p>

<p>
\(G_0 = 1 + \gamma G_0\)
</p>

<p>
\(G_0 - \gamma G_0 = 1\)
</p>

<p>
\(G_0 (1 - \gamma) = 1\)
</p>

<p>
\(G_0 = 1 / (1 - \gamma)\)
</p>
</div>
</div>

<div id="outline-container-orgc8b2f7c" class="outline-4">
<h4 id="orgc8b2f7c">Exercise 3.11</h4>
<div class="outline-text-4" id="text-orgc8b2f7c">
<p>
If the current state is St, and actions are selected according to a stochastic
policy &pi;, then what is the expectation of Rt+1 in terms of &pi; and the four-argument
function p (3.2)? ⇤
</p>

<p>
Framing this as an expectation means we need to sum across all possible actions
</p>

<p>
\(\sum_{a} \pi(a | S_t) \sum_{s', r} r * p(r| s', a)\)
</p>
</div>
</div>

<div id="outline-container-org37b5f22" class="outline-4">
<h4 id="org37b5f22">Exercise 3.12</h4>
<div class="outline-text-4" id="text-org37b5f22">
<p>
Give an equation for v⇡ in terms of q⇡ and &pi;. ⇤
</p>

<p>
\(v_\pi(s) \doteq E_\pi[G_t | S_t = s]\)
</p>

<p>
\(q_\pi(s, a) \doteq E_\pi[G_t | S_t = s, A_t = a]\)
</p>

<p>
&#x2014;
</p>

<p>
To write in terms of q we just need to marginalize over all actions
</p>

<p>
\(v_\pi(s) \doteq \sum_{a} \pi(a|s) E_\pi[G_t | S_t = s, A_t = a]\)
</p>

<p>
that last term is the same as q
</p>

<p>
\(v_\pi(s) \doteq \sum_{a} \pi(a|s) q_\pi(s, a)\)
</p>
</div>
</div>

<div id="outline-container-orgd20274e" class="outline-4">
<h4 id="orgd20274e">Exercise 3.13</h4>
<div class="outline-text-4" id="text-orgd20274e">
<p>
Give an equation for q⇡ in terms of v⇡ and the four-argument p. ⇤
</p>

<p>
\(q_\pi(s, a) \doteq E_\pi[G_t | S_t = s, A_t = a]\)
</p>

<p>
Expanding out G<sub>t</sub>
</p>

<p>
\(q_\pi(s, a) \doteq E_\pi[R_{t+1} + \gamma G_{t+1} | S_t = s, A_t = a]\)
</p>

<p>
Now we can condition on the next state to get v
</p>

<p>
\(q_\pi(s, a) \doteq E_\pi[R_{t+1} + \gamma E[G_{t+1} | S_{t+1}] | S_t = s, A_t = a]\)
</p>

<p>
\(q_\pi(s, a) \doteq E_\pi[R_{t+1} + \gamma v_\pi(S_{t+1}) | S_t = s, A_t = a]\)
</p>

<p>
and now since we have something with the shape (s', r | s, a) we can undo the expectation using the 4 argument p
</p>

<p>
\(q_\pi(s, a) \doteq \sum_{s'} \sum_{r} p(s', r | s, a) * [r + \gamma v_\pi(s')]\)
</p>
</div>
</div>
