org/articles/sutton.org
**** Exercise 3.14

The Bellman equation (3.14) must hold for each state for the value function
v⇡ shown in Figure 3.2 (right) of Example 3.5. Show numerically that this equation holds
for the center state, valued at +0.7, with respect to its four neighboring states, valued at
+2.3, +0.4, 0.4, and +0.7. (These numbers are accurate only to one decimal place.) ⇤

The four actions are equally likely, discount factor is 0.9

the discounted other rewards are 2.07, 0.36, 0.36, 0.63

$0.7 = \sum_{a} 1/4 \sum_{s, r} 1[r + \text{discounted reward}]$

$0.7 = \frac{1}{4} (0 + 2.07) + \frac{1}{4} (0 + 0.36) + \frac{1}{4} (0 + 0.36) + \frac{1}{4} (0 + 0.63)$

$0.7 = 0.5175 + .009 + .009 + .1575$

0.7 = 0.693 (accurate enough to the tenth)

**** Exercise 3.15

In the gridworld example, rewards are positive for goals, negative for
running into the edge of the world, and zero the rest of the time. Are the signs of these
rewards important, or only the intervals between them? Prove, using (3.8), that adding a
constant c to all the rewards adds a constant, vc, to the values of all states, and thus
does not affect the relative values of any states under any policies. What is vc in terms
of c and ? ⇤

Only the differences are important if we're trying to maximize it, the signs are mostly useful to semantically describe which are rewards and which are punishments. The advantage of a good state over a bad one exists independent of sign. 

$G_t \doteq \sum_{k=0}^{\infty} \gamma^k R_{t+k+1}$

$G_t \doteq \sum_{k=0}^{\infty} \gamma^k (R_{t+k+1} + c)$

$G_t \doteq \sum_{k=0}^{\infty} [\gamma^k R_{t+k+1} + \gamma^k c]$

$G_t \doteq \sum_{k=0}^{\infty} \gamma^k R_{t+k+1} + \sum_{k=0}^{\infty} \gamma^k c$

Since it's a constant term (i.e. a sum of constants) We can define $v_c = \sum_{k=0}^{\infty} \gamma^k c$ so $G_t \doteq \sum_{k=0}^{\infty} \gamma^k R_{t+k+1} + v_c$

Ergo, the relative value of the states will not change, because no matter what you will be adding $v_c$ to the state, which does not change from state to state.

**** Exercise 3.16

Now consider adding a constant c to all the rewards in an episodic task,
such as maze running. Would this have any e↵ect, or would it leave the task unchanged
as in the continuing task above? Why or why not? Give an example. ⇤

In an episodic task, it does cause problems to add a constant to all values. Consider maze running. If you have a negative reward for each non-solved turn, and then a big positive reward at the end, your total reward is maximized by getting out of the maze as fast as possible. If you have a small positive reward for each non-solved turn, and then an even bigger reward at the end, your total reward is now maximized by existing in the maze for all eternity, since eventually you will accumulate more reward by deliberately not finding the exit and bounding your reward. 

**** Exercise 3.17

What is the Bellman equation for action values, that
is, for q_\pi? It must give the action value q_\pi(s, a) in terms of the action
values, q_\i(s', a'), of possible successors to the state–action pair (s, a).
Hint: The backup diagram to the right corresponds to this equation.
Show the sequence of equations analogous to (3.14), but for action
values.

Well let's start from bellman equation for values

$v_\pi(s) \doteq \sum_{a} \pi(a|s) \sum_{s', r} p(s', r | s, a) [r + \gamma v_\pi(s')]$

We've already shown we can write v in terms of q

$v_\pi(s) \doteq \sum_{a} \pi(a|s) q_\pi(s, a)$

so it seems to emerge that we can just do this

$q_\pi(s, a) \doteq \sum_{s', r} p(s', r | s, a) [r + \gamma v_\pi(s')]$

/o1: this might be wrong?/

**** Exercise 3.18

The value of a state depends on the values of the actions possible in that
state and on how likely each action is to be taken under the current policy. We can
think of this in terms of a small backup diagram rooted at the state and considering each
possible action:

Give the equation corresponding to this intuition and diagram for the value at the root
node, v⇡(s), in terms of the value at the expected leaf node, q⇡(s, a), given St = s. This
equation should include an expectation conditioned on following the policy, ⇡. Then give
a second equation in which the expected value is written out explicitly in terms of ⇡(a|s)
such that no expected value notation appears in the equation. ⇤

$v_\pi(s) \doteq \mathbb{E}[q_\pi(s, a) | s = S_t]$

$v_\pi(s) \doteq \sum_{a} \pi(a|s) q_\pi(s, a)$

**** Exercise 3.19

The value of an action, q⇡(s, a), depends on the expected next reward and
the expected sum of the remaining rewards. Again we can think of this in terms of a
small backup diagram, this one rooted at an action (state–action pair) and branching to
the possible next states:

Give the equation corresponding to this intuition and diagram for the action value,
q⇡(s, a), in terms of the expected next reward, Rt+1, and the expected next state value,
v⇡(St+1), given that St =s and At =a. This equation should include an expectation but
not one conditioned on following the policy. Then give a second equation, writing out the
expected value explicitly in terms of p(s', r|s, a) defined by (3.2), such that no expected
value notation appears in the equation. ⇤

$q_\pi(s, a) \doteq \mathbb{E}[R_{t+1} + \gamma v_\pi(s') | s = S_t, a = A_t]$

$q_\pi(s, a) \doteq \sum_{s', r} p(s' r | s, a) [r + \gamma v_\pi(s')]$ 

**** Exercise 3.20

Draw or describe the optimal state-value function for the golf example. ⇤

In the golf example the optimal state value function is $max_a \sum_{s', r} p(s' r | s, a)[r + \gamma max_a q_*(s', a')]$

As a result, the state-value function should look like the listed q*(s, driver) contours but with the values subtracted by 1, since the cost of the action is -1 

**** Exercise 3.21

Draw or describe the contours of the optimal action-value function for
putting, q⇤(s, putter), for the golf example. ⇤

it will have the same first contour as v_putt, but then it will have the contours of v_{driver}, until you get to the green, which will entirely be -1 (return to putting)

**** Exercise 3.22

Consider the continuing MDP shown to the
right. The only decision to be made is that in the top state,
where two actions are available, left and right. The numbers
show the rewards that are received deterministically after
each action. There are exactly two deterministic policies,
⇡left and ⇡right. What policy is optimal if \gamma = 0? If \gamma = 0.9?
If \gamma = 0.5? ⇤

if \gamma is zero, future rewards will be ignored, and you'll prefer \pi_{left} which provides immediate reward. With \gamma = 0.9, you'll prefer \pi_{right} since you'll care a lot about the resulting +2 after the first state. At \gamma = 0.5, both policies are equivalent, since left is $1 + 0.5(0) + 0.25 R_{t+3}$ and right is $0 + 0.5(2) + 0.25 R_{t+3}$. 

