articles/sutton.html

<div id="outline-container-org51008ac" class="outline-4">
<h4 id="org51008ac">Exercise 3.14</h4>
<div class="outline-text-4" id="text-org51008ac">
<p>
The Bellman equation (3.14) must hold for each state for the value function
v⇡ shown in Figure 3.2 (right) of Example 3.5. Show numerically that this equation holds
for the center state, valued at +0.7, with respect to its four neighboring states, valued at
+2.3, +0.4, 0.4, and +0.7. (These numbers are accurate only to one decimal place.) ⇤
</p>

<p>
The four actions are equally likely, discount factor is 0.9
</p>

<p>
the discounted other rewards are 2.07, 0.36, 0.36, 0.63
</p>

<p>
\(0.7 = \sum_{a} 1/4 \sum_{s, r} 1[r + \text{discounted reward}]\)
</p>

<p>
\(0.7 = \frac{1}{4} (0 + 2.07) + \frac{1}{4} (0 + 0.36) + \frac{1}{4} (0 + 0.36) + \frac{1}{4} (0 + 0.63)\)
</p>

<p>
\(0.7 = 0.5175 + .009 + .009 + .1575\)
</p>

<p>
0.7 = 0.693 (accurate enough to the tenth)
</p>
</div>
</div>

<div id="outline-container-orgebc80a5" class="outline-4">
<h4 id="orgebc80a5">Exercise 3.15</h4>
<div class="outline-text-4" id="text-orgebc80a5">
<p>
In the gridworld example, rewards are positive for goals, negative for
running into the edge of the world, and zero the rest of the time. Are the signs of these
rewards important, or only the intervals between them? Prove, using (3.8), that adding a
constant c to all the rewards adds a constant, vc, to the values of all states, and thus
does not affect the relative values of any states under any policies. What is vc in terms
of c and ? ⇤
</p>

<p>
Only the differences are important if we're trying to maximize it, the signs are mostly useful to semantically describe which are rewards and which are punishments. The advantage of a good state over a bad one exists independent of sign. 
</p>

<p>
\(G_t \doteq \sum_{k=0}^{\infty} \gamma^k R_{t+k+1}\)
</p>

<p>
\(G_t \doteq \sum_{k=0}^{\infty} \gamma^k (R_{t+k+1} + c)\)
</p>

<p>
\(G_t \doteq \sum_{k=0}^{\infty} [\gamma^k R_{t+k+1} + \gamma^k c]\)
</p>

<p>
\(G_t \doteq \sum_{k=0}^{\infty} \gamma^k R_{t+k+1} + \sum_{k=0}^{\infty} \gamma^k c\)
</p>

<p>
Since it's a constant term (i.e. a sum of constants) We can define \(v_c = \sum_{k=0}^{\infty} \gamma^k c\) so \(G_t \doteq \sum_{k=0}^{\infty} \gamma^k R_{t+k+1} + v_c\)
</p>

<p>
Ergo, the relative value of the states will not change, because no matter what you will be adding \(v_c\) to the state, which does not change from state to state.
</p>
</div>
</div>

<div id="outline-container-orgd0d2f03" class="outline-4">
<h4 id="orgd0d2f03">Exercise 3.16</h4>
<div class="outline-text-4" id="text-orgd0d2f03">
<p>
Now consider adding a constant c to all the rewards in an episodic task,
such as maze running. Would this have any e↵ect, or would it leave the task unchanged
as in the continuing task above? Why or why not? Give an example. ⇤
</p>

<p>
In an episodic task, it does cause problems to add a constant to all values. Consider maze running. If you have a negative reward for each non-solved turn, and then a big positive reward at the end, your total reward is maximized by getting out of the maze as fast as possible. If you have a small positive reward for each non-solved turn, and then an even bigger reward at the end, your total reward is now maximized by existing in the maze for all eternity, since eventually you will accumulate more reward by deliberately not finding the exit and bounding your reward. 
</p>
</div>
</div>

<div id="outline-container-org0707de8" class="outline-4">
<h4 id="org0707de8">Exercise 3.17</h4>
<div class="outline-text-4" id="text-org0707de8">
<p>
What is the Bellman equation for action values, that
is, for q<sub>&pi;</sub>? It must give the action value q<sub>&pi;</sub>(s, a) in terms of the action
values, q<sub>\i</sub>(s', a'), of possible successors to the state–action pair (s, a).
Hint: The backup diagram to the right corresponds to this equation.
Show the sequence of equations analogous to (3.14), but for action
values.
</p>

<p>
Well let's start from bellman equation for values
</p>

<p>
\(v_\pi(s) \doteq \sum_{a} \pi(a|s) \sum_{s', r} p(s', r | s, a) [r + \gamma v_\pi(s')]\)
</p>

<p>
We've already shown we can write v in terms of q
</p>

<p>
\(v_\pi(s) \doteq \sum_{a} \pi(a|s) q_\pi(s, a)\)
</p>

<p>
so it seems to emerge that we can just do this
</p>

<p>
\(q_\pi(s, a) \doteq \sum_{s', r} p(s', r | s, a) [r + \gamma v_\pi(s')]\)
</p>

<p>
<i>o1: this might be wrong?</i>
</p>
</div>
</div>

<div id="outline-container-org7e04c98" class="outline-4">
<h4 id="org7e04c98">Exercise 3.18</h4>
<div class="outline-text-4" id="text-org7e04c98">
<p>
The value of a state depends on the values of the actions possible in that
state and on how likely each action is to be taken under the current policy. We can
think of this in terms of a small backup diagram rooted at the state and considering each
possible action:
</p>

<p>
Give the equation corresponding to this intuition and diagram for the value at the root
node, v⇡(s), in terms of the value at the expected leaf node, q⇡(s, a), given St = s. This
equation should include an expectation conditioned on following the policy, ⇡. Then give
a second equation in which the expected value is written out explicitly in terms of ⇡(a|s)
such that no expected value notation appears in the equation. ⇤
</p>

<p>
\(v_\pi(s) \doteq \mathbb{E}[q_\pi(s, a) | s = S_t]\)
</p>

<p>
\(v_\pi(s) \doteq \sum_{a} \pi(a|s) q_\pi(s, a)\)
</p>
</div>
</div>

<div id="outline-container-orgcfd499f" class="outline-4">
<h4 id="orgcfd499f">Exercise 3.19</h4>
<div class="outline-text-4" id="text-orgcfd499f">
<p>
The value of an action, q⇡(s, a), depends on the expected next reward and
the expected sum of the remaining rewards. Again we can think of this in terms of a
small backup diagram, this one rooted at an action (state–action pair) and branching to
the possible next states:
</p>

<p>
Give the equation corresponding to this intuition and diagram for the action value,
q⇡(s, a), in terms of the expected next reward, Rt+1, and the expected next state value,
v⇡(St+1), given that St =s and At =a. This equation should include an expectation but
not one conditioned on following the policy. Then give a second equation, writing out the
expected value explicitly in terms of p(s', r|s, a) defined by (3.2), such that no expected
value notation appears in the equation. ⇤
</p>

<p>
\(q_\pi(s, a) \doteq \mathbb{E}[R_{t+1} + \gamma v_\pi(s') | s = S_t, a = A_t]\)
</p>

<p>
\(q_\pi(s, a) \doteq \sum_{s', r} p(s' r | s, a) [r + \gamma v_\pi(s')]\) 
</p>
</div>
</div>

<div id="outline-container-org885f668" class="outline-4">
<h4 id="org885f668">Exercise 3.20</h4>
<div class="outline-text-4" id="text-org885f668">
<p>
Draw or describe the optimal state-value function for the golf example. ⇤
</p>

<p>
In the golf example the optimal state value function is \(max_a \sum_{s', r} p(s' r | s, a)[r + \gamma max_a q_*(s', a')]\)
</p>

<p>
As a result, the state-value function should look like the listed q*(s, driver) contours but with the values subtracted by 1, since the cost of the action is -1 
</p>
</div>
</div>

<div id="outline-container-org30117a6" class="outline-4">
<h4 id="org30117a6">Exercise 3.21</h4>
<div class="outline-text-4" id="text-org30117a6">
<p>
Draw or describe the contours of the optimal action-value function for
putting, q⇤(s, putter), for the golf example. ⇤
</p>

<p>
it will have the same first contour as v<sub>putt</sub>, but then it will have the contours of v<sub>driver</sub>, until you get to the green, which will entirely be -1 (return to putting)
</p>
</div>
</div>

<div id="outline-container-org430be7a" class="outline-4">
<h4 id="org430be7a">Exercise 3.22</h4>
<div class="outline-text-4" id="text-org430be7a">
<p>
Consider the continuing MDP shown to the
right. The only decision to be made is that in the top state,
where two actions are available, left and right. The numbers
show the rewards that are received deterministically after
each action. There are exactly two deterministic policies,
⇡left and ⇡right. What policy is optimal if &gamma; = 0? If &gamma; = 0.9?
If &gamma; = 0.5? ⇤
</p>

<p>
if &gamma; is zero, future rewards will be ignored, and you'll prefer &pi;<sub>left</sub> which provides immediate reward. With &gamma; = 0.9, you'll prefer &pi;<sub>right</sub> since you'll care a lot about the resulting +2 after the first state. At &gamma; = 0.5, both policies are equivalent, since left is \(1 + 0.5(0) + 0.25 R_{t+3}\) and right is \(0 + 0.5(2) + 0.25 R_{t+3}\). 
</p>
</div>
</div>
