org/articles/sutton.org
**** Exercise 3.23

Give the Bellman equation for q_* for the recycling robot. ⇤

Given that v_* is provided in the text, and v_*(s) = max q_*(s, a), we can just say

$q_*(s, a) = \sum_{s', r} p(s', r | s, a) [r + \gamma v_*(s')]$

where v_*(s') are the provided optimality equations for the recycling robot from the text.

I don't really want to write it all out in tex. I can revisit this if necessary.

**** Exercise 3.24

Figure 3.5 gives the optimal value of the best state of the gridworld as
24.4, to one decimal place. Use your knowledge of the optimal policy and (3.8) to express
this value symbolically, and then to compute it to three decimal places. ⇤

Recall the bellman equation

$v_\pi(s) = \sum_{a} \pi(a|s) \sum_{s, r} p(s' r | s, a) [r + \gamma v_\pi(s')]$

In our case, we have a reward of 10, a fixed action, and a certain probability of identical reward and state transition. So:

$v_*(s) = 10 + \gamma v_*(s')$

We know that v_*(s') here is 16, and I think it was mentioned that \gamma was 0.9

Ergo $v_*(s) = 10 + 0.9(16) = 24.400$

A bit confused about this problem, I guess I could chain it together until I arrive back at v_* but I don't really feel like doing that at the moment.

**** Exercise 3.25

Give an equation for v_* in terms of q_*. ⇤

Isn't this just $v_* = max_a q_*(s, a)$

**** Exercise 3.26

Give an equation for q⇤ in terms of v⇤ and the four-argument p. ⇤

This was already in the text I think, it's $q_*(s, a) = \sum_{s', r} p(s', r | s, a) [r + \gamma v_*(s')]$

**** Exercise 3.27

Give an equation for \pi_* in terms of q_*. ⇤

$\pi_*(a | s) = \mathbb{1}[q_*(s, a) = max_{a \in A}(q_*(s, a))]$

/Note: I am not thrilled with this answer. I feel like it should actually be something like this:/

$\pi_*(a | s) = \frac{\mathbb{1}[q_*(s, a) = max_{a \in A}(q_*(s, a))]}{\sum \mathbb{1}[q_*(s, a) = max_{a \in A}(q_*(s, a))]}$

/Because in the case where multiple actions are equally optimal they'll both be 1, which means the total probability will sum to greater than 1 which isn't right, I think. This seems way too wordy but at least conceptually has the right idea./

**** Exercise 3.28

Give an equation for \pi_* in terms of v_* and the four-argument p. ⇤

$\pi_*(a | s) = \mathbb{1}[\sum_{s', r} p(s', r | s, a) [r + \gamma v_*(s')] = max_{a}(\sum_{s', r} p(s', r | s, a) [r + \gamma v_*(s')])]$

**** Exercise 3.29

Rewrite the four Bellman equations for the four value functions (v_\pi, v_*, q_\pi,
and q_*) in terms of the three argument function p (3.4) and the two-argument function r
(3.5). ⇤

$v_\pi(s) = \sum_{a} \pi(a|s) [r(s, a) + \gamma \sum_{s'} p(s' | s, a) v_\pi(s')]$

$v_*(s) = max_{a \in A} [r(s,a) + \gamma \sum_{s'} p(s'|s, a) v_*(s')]$

$q_\pi(s, a) = r(s, a) + \gamma \sum_{s'} p(s' | s, a) \sum_{a'} \pi(a' | s') q_\pi(s', a')$

$q_*(s, a) = r(s, a) + \gamma \sum_{s'} p(s' | s,a) max_{a'}q_*(s', a')$

*** 4 - Dynamic Programming

/status: checked with o1-preview, but maybe it was a bit much for it/

**** Exercise 4.1

In Example 4.1, if \pi is the equiprobable random policy, what is q_{\pi}(11, down)?
What is q_{\pi}(7, down)?

$q_{\pi}(s,a) \doteq \sum_{s', r} p(s', r | s, a)[r + \gamma v_\pi(s')]$

because it's not discounted, and the rewards and state transitions are fixed

$q_{\pi}(11, down) \doteq 1[-1 + v_\pi(s')] = -1$

...since v_\pi(s') has to be 0 (it's a terminal state)

$q_{\pi}(7,down) \doteq \sum_{s', r} p(s', r | s, a)[r + \gamma v_\pi(s')]$

$q_{\pi}(7,down) \doteq -1 + v_\pi(11)$

Which depends on k per the diagram (at initialization v_\pi(11) is 0, but eventually it climbs)

**** Exercise 4.2

In Example 4.1, suppose a new state 15 is added to the gridworld just below
state 13, and its actions, left, up, right, and down, take the agent to states 12, 13, 14,
and 15, respectively. Assume that the transitions from the original states are unchanged.
What, then, is v_{\pi}(15) for the equiprobable random policy? Now suppose the dynamics of
state 13 are also changed, such that action down from state 13 takes the agent to the new
state 15. What is v_{\pi}(15) for the equiprobable random policy in this case? ⇤

$\sum_{a} 1/4 (-1 + v_\pi(s'))$

That is, 1/4 (-1 + v_\pi(12)) + 1/4 (-1 + v_\pi(13)) + 1/4 (-1 + v_\pi(14)) + 1/4 (-1 + v_\pi(15))

or just -1 + 1/4(v_\pi(12) + v_\pi(13) + v_\pi(14) + v_\pi(15))

if down in state 13 moves us to 15 instead of 13, then 13's v values needs to be recalc as

$v'_{\pi}(13) = -1 + 1/4(v_\pi(12) + v_\pi(9) + v_\pi(14) + v_\pi(15))$

and then v_\pi(15) would be

$v_\pi(15) = -1 + 1/4(v_\pi(12) + v'_\pi(13) + v_\pi(14) + v_\pi(15))$

These can probably be calculated from the listed converged values, but I guess it depends on k.

**** Exercise 4.3

What are the equations analogous to (4.3), (4.4), and (4.5), but for actionvalue functions instead of state-value functions?

(4.3) $v_\pi(s) \doteq \mathbb{E}_\pi[R_{t+1} + \gamma v_\pi(S_{t+1})]$

(4.4) $v_\pi(s) \doteq \sum_{a} \pi(a|s) \sum_{s', r} p(s', r | s, a) [r + \gamma v_\pi(s')]$

(4.5) $v_{k+1}(s) \doteq \max_{a} \pi(a|s) \sum_{s', r}p(s', r | s, a)[r + \gamma v_k(s')]$

(4.3) $q_\pi(s, a) \doteq \mathbb{E}_\pi[R_{t+1} + \gamma q_\pi(S_{t+1}, A_{t+1}) | s=S_t, a=A_t]$

(4.4) $q_\pi(s, a) \doteq \sum_{s', r} p(s', r | s, a) [r + \gamma \sum_{a'} \pi(a'|s') q_\pi(s', a')]$

(4.5) $q_{k+1}(s, a) \doteq \sum_{s', r}p(s', r | s, a)[r + \gamma max_{a'}q_k(s', a')]$

**** Exercise 4.4

The policy iteration algorithm on page 80 has a subtle bug in that it may
never terminate if the policy continually switches between two or more policies that are
equally good. This is okay for pedagogy, but not for actual use. Modify the pseudocode
so that convergence is guaranteed. ⇤

The only way it's possible to repeatedly switch between policies that are equally good but not the same are if the resulting rewards from both states are the same. In this code we save the existing action \pi(s) and then assign the action in that state to the argmax of the new values. All we have to do to avoid this bug is additionally store old-value which is just V(old-action), and then mark policy-stable as false if V(\pi(s)) != V(old-action). We don't care if the action changes, we care if the policy improves. 

