articles/sutton.html

<div id="outline-container-org41796cb" class="outline-4">
<h4 id="org41796cb">Exercise 3.23</h4>
<div class="outline-text-4" id="text-org41796cb">
<p>
Give the Bellman equation for q<sub>*</sub> for the recycling robot. ⇤
</p>

<p>
Given that v<sub>*</sub> is provided in the text, and v<sub>*</sub>(s) = max q<sub>*</sub>(s, a), we can just say
</p>

<p>
\(q_*(s, a) = \sum_{s', r} p(s', r | s, a) [r + \gamma v_*(s')]\)
</p>

<p>
where v<sub>*</sub>(s') are the provided optimality equations for the recycling robot from the text.
</p>

<p>
I don't really want to write it all out in tex. I can revisit this if necessary.
</p>
</div>
</div>

<div id="outline-container-orgfe05921" class="outline-4">
<h4 id="orgfe05921">Exercise 3.24</h4>
<div class="outline-text-4" id="text-orgfe05921">
<p>
Figure 3.5 gives the optimal value of the best state of the gridworld as
24.4, to one decimal place. Use your knowledge of the optimal policy and (3.8) to express
this value symbolically, and then to compute it to three decimal places. ⇤
</p>

<p>
Recall the bellman equation
</p>

<p>
\(v_\pi(s) = \sum_{a} \pi(a|s) \sum_{s, r} p(s' r | s, a) [r + \gamma v_\pi(s')]\)
</p>

<p>
In our case, we have a reward of 10, a fixed action, and a certain probability of identical reward and state transition. So:
</p>

<p>
\(v_*(s) = 10 + \gamma v_*(s')\)
</p>

<p>
We know that v<sub>*</sub>(s') here is 16, and I think it was mentioned that &gamma; was 0.9
</p>

<p>
Ergo \(v_*(s) = 10 + 0.9(16) = 24.400\)
</p>

<p>
A bit confused about this problem, I guess I could chain it together until I arrive back at v<sub>*</sub> but I don't really feel like doing that at the moment.
</p>
</div>
</div>

<div id="outline-container-orgcae5c74" class="outline-4">
<h4 id="orgcae5c74">Exercise 3.25</h4>
<div class="outline-text-4" id="text-orgcae5c74">
<p>
Give an equation for v<sub>*</sub> in terms of q<sub>*</sub>. ⇤
</p>

<p>
Isn't this just \(v_* = max_a q_*(s, a)\)
</p>
</div>
</div>

<div id="outline-container-org8b7c1ef" class="outline-4">
<h4 id="org8b7c1ef">Exercise 3.26</h4>
<div class="outline-text-4" id="text-org8b7c1ef">
<p>
Give an equation for q⇤ in terms of v⇤ and the four-argument p. ⇤
</p>

<p>
This was already in the text I think, it's \(q_*(s, a) = \sum_{s', r} p(s', r | s, a) [r + \gamma v_*(s')]\)
</p>
</div>
</div>

<div id="outline-container-orgce0d19b" class="outline-4">
<h4 id="orgce0d19b">Exercise 3.27</h4>
<div class="outline-text-4" id="text-orgce0d19b">
<p>
Give an equation for &pi;<sub>*</sub> in terms of q<sub>*</sub>. ⇤
</p>

<p>
\(\pi_*(a | s) = \mathbb{1}[q_*(s, a) = max_{a \in A}(q_*(s, a))]\)
</p>

<p>
<i>Note: I am not thrilled with this answer. I feel like it should actually be something like this:</i>
</p>

<p>
\(\pi_*(a | s) = \frac{\mathbb{1}[q_*(s, a) = max_{a \in A}(q_*(s, a))]}{\sum \mathbb{1}[q_*(s, a) = max_{a \in A}(q_*(s, a))]}\)
</p>

<p>
<i>Because in the case where multiple actions are equally optimal they'll both be 1, which means the total probability will sum to greater than 1 which isn't right, I think. This seems way too wordy but at least conceptually has the right idea.</i>
</p>
</div>
</div>

<div id="outline-container-org50fc3b3" class="outline-4">
<h4 id="org50fc3b3">Exercise 3.28</h4>
<div class="outline-text-4" id="text-org50fc3b3">
<p>
Give an equation for &pi;<sub>*</sub> in terms of v<sub>*</sub> and the four-argument p. ⇤
</p>

<p>
\(\pi_*(a | s) = \mathbb{1}[\sum_{s', r} p(s', r | s, a) [r + \gamma v_*(s')] = max_{a}(\sum_{s', r} p(s', r | s, a) [r + \gamma v_*(s')])]\)
</p>
</div>
</div>

<div id="outline-container-org8f5683d" class="outline-4">
<h4 id="org8f5683d">Exercise 3.29</h4>
<div class="outline-text-4" id="text-org8f5683d">
<p>
Rewrite the four Bellman equations for the four value functions (v<sub>&pi;</sub>, v<sub>*</sub>, q<sub>&pi;</sub>,
and q<sub>*</sub>) in terms of the three argument function p (3.4) and the two-argument function r
(3.5). ⇤
</p>

<p>
\(v_\pi(s) = \sum_{a} \pi(a|s) [r(s, a) + \gamma \sum_{s'} p(s' | s, a) v_\pi(s')]\)
</p>

<p>
\(v_*(s) = max_{a \in A} [r(s,a) + \gamma \sum_{s'} p(s'|s, a) v_*(s')]\)
</p>

<p>
\(q_\pi(s, a) = r(s, a) + \gamma \sum_{s'} p(s' | s, a) \sum_{a'} \pi(a' | s') q_\pi(s', a')\)
</p>

<p>
\(q_*(s, a) = r(s, a) + \gamma \sum_{s'} p(s' | s,a) max_{a'}q_*(s', a')\)
</p>
</div>
</div>
</div>

<div id="outline-container-org537478e" class="outline-3">
<h3 id="org537478e">4 - Dynamic Programming</h3>
<div class="outline-text-3" id="text-org537478e">
<p>
<i>status: checked with o1-preview, but maybe it was a bit much for it</i>
</p>
</div>

<div id="outline-container-org8ac6a43" class="outline-4">
<h4 id="org8ac6a43">Exercise 4.1</h4>
<div class="outline-text-4" id="text-org8ac6a43">
<p>
In Example 4.1, if &pi; is the equiprobable random policy, what is q<sub>&pi;</sub>(11, down)?
What is q<sub>&pi;</sub>(7, down)?
</p>

<p>
\(q_{\pi}(s,a) \doteq \sum_{s', r} p(s', r | s, a)[r + \gamma v_\pi(s')]\)
</p>

<p>
because it's not discounted, and the rewards and state transitions are fixed
</p>

<p>
\(q_{\pi}(11, down) \doteq 1[-1 + v_\pi(s')] = -1\)
</p>

<p>
&#x2026;since v<sub>&pi;</sub>(s') has to be 0 (it's a terminal state)
</p>

<p>
\(q_{\pi}(7,down) \doteq \sum_{s', r} p(s', r | s, a)[r + \gamma v_\pi(s')]\)
</p>

<p>
\(q_{\pi}(7,down) \doteq -1 + v_\pi(11)\)
</p>

<p>
Which depends on k per the diagram (at initialization v<sub>&pi;</sub>(11) is 0, but eventually it climbs)
</p>
</div>
</div>

<div id="outline-container-orge7bd185" class="outline-4">
<h4 id="orge7bd185">Exercise 4.2</h4>
<div class="outline-text-4" id="text-orge7bd185">
<p>
In Example 4.1, suppose a new state 15 is added to the gridworld just below
state 13, and its actions, left, up, right, and down, take the agent to states 12, 13, 14,
and 15, respectively. Assume that the transitions from the original states are unchanged.
What, then, is v<sub>&pi;</sub>(15) for the equiprobable random policy? Now suppose the dynamics of
state 13 are also changed, such that action down from state 13 takes the agent to the new
state 15. What is v<sub>&pi;</sub>(15) for the equiprobable random policy in this case? ⇤
</p>

<p>
\(\sum_{a} 1/4 (-1 + v_\pi(s'))\)
</p>

<p>
That is, 1/4 (-1 + v<sub>&pi;</sub>(12)) + 1/4 (-1 + v<sub>&pi;</sub>(13)) + 1/4 (-1 + v<sub>&pi;</sub>(14)) + 1/4 (-1 + v<sub>&pi;</sub>(15))
</p>

<p>
or just -1 + 1/4(v<sub>&pi;</sub>(12) + v<sub>&pi;</sub>(13) + v<sub>&pi;</sub>(14) + v<sub>&pi;</sub>(15))
</p>

<p>
if down in state 13 moves us to 15 instead of 13, then 13's v values needs to be recalc as
</p>

<p>
\(v'_{\pi}(13) = -1 + 1/4(v_\pi(12) + v_\pi(9) + v_\pi(14) + v_\pi(15))\)
</p>

<p>
and then v<sub>&pi;</sub>(15) would be
</p>

<p>
\(v_\pi(15) = -1 + 1/4(v_\pi(12) + v'_\pi(13) + v_\pi(14) + v_\pi(15))\)
</p>

<p>
These can probably be calculated from the listed converged values, but I guess it depends on k.
</p>
</div>
</div>

<div id="outline-container-orga67e87d" class="outline-4">
<h4 id="orga67e87d">Exercise 4.3</h4>
<div class="outline-text-4" id="text-orga67e87d">
<p>
What are the equations analogous to (4.3), (4.4), and (4.5), but for actionvalue functions instead of state-value functions?
</p>

<p>
(4.3) \(v_\pi(s) \doteq \mathbb{E}_\pi[R_{t+1} + \gamma v_\pi(S_{t+1})]\)
</p>

<p>
(4.4) \(v_\pi(s) \doteq \sum_{a} \pi(a|s) \sum_{s', r} p(s', r | s, a) [r + \gamma v_\pi(s')]\)
</p>

<p>
(4.5) \(v_{k+1}(s) \doteq \max_{a} \pi(a|s) \sum_{s', r}p(s', r | s, a)[r + \gamma v_k(s')]\)
</p>

<p>
(4.3) \(q_\pi(s, a) \doteq \mathbb{E}_\pi[R_{t+1} + \gamma q_\pi(S_{t+1}, A_{t+1}) | s=S_t, a=A_t]\)
</p>

<p>
(4.4) \(q_\pi(s, a) \doteq \sum_{s', r} p(s', r | s, a) [r + \gamma \sum_{a'} \pi(a'|s') q_\pi(s', a')]\)
</p>

<p>
(4.5) \(q_{k+1}(s, a) \doteq \sum_{s', r}p(s', r | s, a)[r + \gamma max_{a'}q_k(s', a')]\)
</p>
</div>
</div>

<div id="outline-container-org976b9c4" class="outline-4">
<h4 id="org976b9c4">Exercise 4.4</h4>
<div class="outline-text-4" id="text-org976b9c4">
<p>
The policy iteration algorithm on page 80 has a subtle bug in that it may
never terminate if the policy continually switches between two or more policies that are
equally good. This is okay for pedagogy, but not for actual use. Modify the pseudocode
so that convergence is guaranteed. ⇤
</p>

<p>
The only way it's possible to repeatedly switch between policies that are equally good but not the same are if the resulting rewards from both states are the same. In this code we save the existing action &pi;(s) and then assign the action in that state to the argmax of the new values. All we have to do to avoid this bug is additionally store old-value which is just V(old-action), and then mark policy-stable as false if V(&pi;(s)) != V(old-action). We don't care if the action changes, we care if the policy improves. 
</p>
</div>
</div>
