articles/sutton.html

<div id="outline-container-org625cf9d" class="outline-4">
<h4 id="org625cf9d">Exercise 4.5</h4>
<div class="outline-text-4" id="text-org625cf9d">
<p>
How would policy iteration be defined for action values? Give a complete
algorithm for computing q⇤, analogous to that on page 80 for computing v⇤. Please pay
special attention to this exercise, because the ideas involved will be used throughout the
rest of the book. ⇤
</p>

<p>
in policy evaluation you can substitute these lines
</p>

<p>
\(v \leftarrow V(s)\)
</p>

<p>
\(V(s) \leftarrow \sum_{s', r} p(s', r | s, \pi(s))[r + \gamma V(s')]\)
</p>

<p>
\(\Delta \leftarrow max(\Delta, |v - V(s)|)\)
</p>

<p>
with this, looping over \(a \in A\):
</p>

<p>
\(q \leftarrow Q(s, a)\)
</p>

<p>
\(Q(s, a) \leftarrow \sum_{s', r} p(s', r | s, a)[r + \gamma [\sum_{a'}Q(s', a')\pi(a|s')]]\)
</p>

<p>
\(\Delta \leftarrow max(\Delta, |q - Q(s)|)\)
</p>

<p>
and it should be good from there (plus changing initialization and updating policy with max q instead of v, of course). The important part is that since you're not keeping track of V(s), you have to expand it out in terms of Q, which involves the all the possible actions over the next state.
</p>
</div>
</div>

<div id="outline-container-org63ff211" class="outline-4">
<h4 id="org63ff211">Exercise 4.6</h4>
<div class="outline-text-4" id="text-org63ff211">
<p>
Suppose you are restricted to considering only policies that are &epsilon;-soft,
meaning that the probability of selecting each action in each state, s, is at least &epsilon;/|A(s)|.
Describe qualitatively the changes that would be required in each of the steps 3, 2, and 1,
in that order, of the policy iteration algorithm for v⇤ on page 80. ⇤
</p>

<p>
In step 3, you would replace the argmax assignment with one which takes the argmax with probability 1 - &epsilon; and takes a random action with probability &epsilon;
</p>

<p>
In step 2, you would need to replace the value update step with one which first sums across all actions and multiplies them by the probability \(\pi(a|s)\).
</p>

<p>
In step 1, you'll need to declare an epsilon.
</p>
</div>
</div>

<div id="outline-container-orgf65ecef" class="outline-4">
<h4 id="orgf65ecef">Exercise 4.7 (programming)</h4>
<div class="outline-text-4" id="text-orgf65ecef">
<p>
Write a program for policy iteration and re-solve Jack’s car
rental problem with the following changes. One of Jack’s employees at the first location
rides a bus home each night and lives near the second location. She is happy to shuttle
one car to the second location for free. Each additional car still costs $2, as do all cars
moved in the other direction. In addition, Jack has limited parking space at each location.
If more than 10 cars are kept overnight at a location (after any moving of cars), then an
additional cost of $4 must be incurred to use a second parking lot (independent of how
many cars are kept there). These sorts of nonlinearities and arbitrary dynamics often
occur in real problems and cannot easily be handled by optimization methods other than
dynamic programming. To check your program, first replicate the results given for the
original problem.
</p>

<div class="org-src-container">
<pre class="src src-python">import math
import numpy as np

def get_proba(n, lam):
    return ((lam ** n)/(math.factorial(n))) * np.exp(-lam)

lam_rent_l1 = 3
lam_return_l1 = 3
lam_rent_l2 = 4
lam_return_l2 = 2

max_cars = 20
max_move = 5

gamma = 0.9

## policy iter
vals = [[0 for _ in range(max_cars+1)] for _ in range(max_cars+1)]
policy = [[0 for _ in range(max_cars+1)] for _ in range(max_cars+1)]

# poisson gets very small after less than the full range so we can just ignore the tails
rent_transition_probs_l1 = [get_proba(x, lam_rent_l1) for x in range(11)]
rent_transition_probs_l2 = [get_proba(x, lam_rent_l2) for x in range(11)]
ret_transition_probs_l1 = [get_proba(x, lam_return_l1) for x in range(11)]
ret_transition_probs_l2 = [get_proba(x, lam_return_l2) for x in range(11)]

# make this tractable
def get_t_probs(a, b, c, d):
    t_probs = [[[[1 for _ in a] for _ in b] for _ in c] for _ in d]

    for i,x in enumerate(a):
	for j,y in enumerate(b):
	    two_prob = x * y
	    for k,z in enumerate(c):
		three_prob = two_prob * z
		for l,zz in enumerate(d):
		    t_probs[i][j][k][l] = three_prob * zz

    return t_probs

t_probs_table = get_t_probs(rent_transition_probs_l1,
			    rent_transition_probs_l2,
			    ret_transition_probs_l1,
			    ret_transition_probs_l2)

def expected_return(state, action, vals):
    i,j = state
    old_val = vals[i][j]
    move = action

    new_value = 0

    #for all r, s'
    # employee is willing to move 1 car for free
    if move &gt; 0:
	base_reward = -2 * abs(move-1)
    else:
	base_reward = -2 * abs(move)
    table_dims = 11 # hard coded for now
    for x_sub in range(table_dims):
	for x_add in range(table_dims):
	    for y_sub in range(table_dims):
		for y_add in range(table_dims):
		    # you cannot rent out more than you have
		    reward = 10*(min(i, x_sub) + min(j, y_sub))
		    reward += base_reward
		    new_i = i - move + x_add - min(i, x_sub)
		    new_i = min(20, max(0, new_i))
		    new_j = j + move + y_add - min(j, y_sub)
		    new_j = min(20, max(0, new_j))

		    # add 2nd parking lot penalty for both locations
		    if new_i &gt; 10:
			reward -= 4
		    if new_j &gt; 10:
			reward -= 4

		    next_state_value = vals[new_i][new_j]
		    transition_prob = t_probs_table[x_sub][x_add][y_sub][y_add]

		    new_value += transition_prob * (reward + gamma*next_state_value)

    delta = abs(old_val - new_value)
    return new_value, delta

def policy_iteration(vals, policy, probs):
    theta = 1
    delta = theta+1
    while delta &gt; theta:
	print(f"delta: {delta}, theta: {theta}")
	delta = 0
	#for all s
	for i in range(max_cars+1):
	    print(f"row i {i}")
	    for j in range(max_cars+1):
		new_value, obs_delta = expected_return((i,j), policy[i][j], vals)
		vals[i][j] = new_value
		delta = max(delta, obs_delta)

    return vals, policy

# policy improvement
policy_stable = False
while not policy_stable:
    policy_stable = True
    #if policy-stable, stop, else do policy iteration then improvement
    print(f"doing policy iteration!")
    vals, policy = policy_iteration(vals, policy, t_probs_table)

    print(f"improving the policy now!")
    #for all s
    for i in range(max_cars+1):
	print(f"Improving row {i}")
	for j in range(max_cars+1):
	    old_action = policy[i][j]
	    new_action = old_action
	    old_action_value, _ = expected_return((i,j), policy[i][j], vals)

	    for a in range(-max_move, max_move):
		new_action_value, _ = expected_return((i,j), a, vals)

		if new_action_value &gt; old_action_value:
		    new_action = a
		    old_action_value = new_action_value
		    policy_stable = False

	    policy[i][j] = new_action

</pre>
</div>

<p>
Overall I'm not thrilled with this implementation &#x2013; it does recreate everything per the text but I can't shake the feeling there's some substantial optimization improvements I can be doing here.
</p>

<p>
The plots <a href="https://colab.research.google.com/drive/1z22bO2K3tGWaLHA6uEO6xCunwU5Msav_?usp=sharing">look reasonable</a>, though.
</p>
</div>
</div>

<div id="outline-container-org336d135" class="outline-4">
<h4 id="org336d135">Exercise 4.8</h4>
<div class="outline-text-4" id="text-org336d135">
<p>
Why does the optimal
policy for the gambler’s problem have such a curious form? In particular, for capital of 50
it bets it all on one flip, but for capital of 51 it does not. Why is this a good policy? ⇤
</p>

<p>
If you imagine the all flip at 50 being 0.4 probability to win, betting 1 at 51 means you are adding the probability of getting 50 more points starting with 1 to the fixed probability of 0.4, making it strictly better. Not sure it's intuitive why it's optimal but it definitely does not make sense to bet 51 (because you only need 100).
</p>
</div>
</div>
