org/articles/sutton.org
**** Exercise 4.9 (programming)

Implement value iteration for the gambler’s problem and
solve it for ph = 0.25 and ph = 0.55. In programming, you may find it convenient to
introduce two dummy states corresponding to termination with capital of 0 and 100,
giving them values of 0 and 1 respectively. Show your results graphically, as in Figure 4.3.
Are your results stable as \theta \rightarrow 0? ⇤

#+BEGIN_SRC python
import math
import numpy as np
from matplotlib import pyplot as plt

def value_iteration(vals, actions, theta, ph):
    iters = 0
    delta = theta+1
    while delta > theta or iters < 256:
        iters += 1
        delta = 0
        for s in range(1, 100):
            v = vals[s]
            max_checkval = None
            for bet in range(actions[s]+1):
                check_val = (ph * vals[min(100, s + bet)]) + ((1-ph) * vals[max(0, s - bet)])
                if not max_checkval or check_val > max_checkval:
                    max_checkval = check_val
            delta = max(delta, abs(v - max_checkval))
            vals[s] = max_checkval

    policy = []

    for s in range(1,100):
        greedy_act = 0
        greedy_val = 0
        for bet in range(1, actions[s]+1):
            q = (ph * vals[min(100, s + bet)]) + ((1-ph) * vals[max(0, s - bet)])
            if q > greedy_val:
                greedy_val = q
                greedy_act = bet

        policy.append(greedy_act)

    return policy, vals

def viz(policy, values):
    plt.plot(policy)
    plt.show()

    plt.plot(values)
    plt.show()

ph = 0.4
vals = [0 for x in range(101)]
vals[-1] = 1
actions = [x for x in range(100)]
theta = 1e-12

p_4, v_4 = value_iteration(vals, actions, theta, ph)
viz(p_4, v_4)

ph = 0.2
vals = [0 for x in range(101)]
vals[-1] = 1
actions = [x for x in range(100)]
theta = 1e-12

p_2, v_2 = value_iteration(vals, actions, theta, ph)
viz(p_2, v_2)

#+END_SRC

Honestly, no. The value and policy both do converge, given enough timesteps, but the form they take is pretty unusual. I wonder if there are multiple optimal actions for each state, and the wild behavior of the policy is not preferring one type of state to the other? The code is pretty simple so I imagine this has to do with the problem statement, but I'm definitely left with more questions than answers. 

**** Exercise 4.10

What is the analog of the value iteration update (4.10) for action values,
q_{k+1}(s, a)? ⇤

(4.10) $v_{k+1}(s) \doteq max_a \sum_{s', r} p(s', r | s, a) [r + \gamma v_k(s')]$

$q_{k+1}(s, a) \doteq  \sum_{s', r} p(s', r | s, a) [r + \gamma \sum_{a'} \pi(a|s) q_k(s')]$

*** (In Progress) 5 - Monte Carlo Methods

/Status: Need to do programming exercise/

**** Exercise 5.1

Consider the diagrams on the right in Figure 5.1. Why does the estimated
value function jump up for the last two rows in the rear? Why does it drop off for the
whole last row on the left? Why are the frontmost values higher in the upper diagrams
than in the lower? ⇤

It jumps up because those are the ones you stick and often win. It drops off on the left because if the dealer has a usable ace they're more likely to win also. Frontmost values are higher in the upper diagrams because having a useable ace lets you salvage bad hands by going over 21 and looping back to a lower value.

**** Exercise 5.2

Suppose every-visit MC was used instead of first-visit MC on the blackjack
task. Would you expect the results to be very different? Why or why not? ⇤

Because it also quadratically converges to v_\pi I imagine it would largely look the same. Especially because the episode lengths are very short, the only states which would be revisitable are small sums which are looped back upon with the usable ace, otherwise per-episode it should be about the same everywhere. 

**** Exercise 5.3

What is the backup diagram for Monte Carlo estimation of q⇡? ⇤

It should look like the backup diagram on page 95, a single line representing the experience, but starting from an action instead of a state. One episode, no bootstrapping.

**** Exercise 5.4

The pseudocode for Monte Carlo ES is inefficient because, for each state–
action pair, it maintains a list of all returns and repeatedly calculates their mean. It would
be more ecient to use techniques similar to those explained in Section 2.4 to maintain
just the mean and a count (for each state–action pair) and update them incrementally.
Describe how the pseudocode would be altered to achieve this. ⇤

Initialize returns as a list of tuples (0,0) instead of an empty list.

Instead of appending, add 1 to the second value and change the first value to the reward + 1 / second value times the old first value. 

**** Exercise 5.5

Consider an MDP with a single nonterminal state and a single action
that transitions back to the nonterminal state with probability p and transitions to the
terminal state with probability 1p. Let the reward be +1 on all transitions, and let
 = 1. Suppose you observe one episode that lasts 10 steps, with a return of 10. What
are the first-visit and every-visit estimators of the value of the nonterminal state? ⇤

The first-visit should be $V(S) = G_0$ which refers to the episode reward, NOT the immediate reward. So in this case, it would be 10.

First visit it will be 10 like above. Second visit it will be 9 (since we lose the reward from the first transition). This will get added to returns which will make it [10,9], and the average is 9.5. This will continue [10,9,8,7,6,5,4,3,2,1], and the average of this is 55/10 = 5.5. 

**** Exercise 5.6

What is the equation analogous to (5.6) for action values Q(s, a) instead of
state values V (s), again given returns generated using b? ⇤

I actually think it should be pretty much the same? We need to change $t \in T(s)$ to be instead $t \in T(s, a)$ but p is already in terms of the actions of each policy rather than as states, and we are doing it episode by episode which means its the same episode but in terms of the state-action transitions rather than the states alone. 

**** Exercise 5.7

In learning curves such as those shown in Figure 5.3 error generally decreases
with training, as indeed happened for the ordinary importance-sampling method. But for
the weighted importance-sampling method error first increased and then decreased. Why
do you think this happened? ⇤

Weighted importance sampling starts from a biased estimation and updates a ratio towards the other policy, compared to ordinary importance sampling which monotonically increases the denominator. With OIS, the variance is high that improving with more samples is much larger than the effect of having only a few samples, but with WIS, you'll likely need a few samples before it starts heading in the right direction, which could lead to a temporary increase in error.

