articles/sutton.html

<div id="outline-container-org1d9ce9d" class="outline-4">
<h4 id="org1d9ce9d">Exercise 4.9 (programming)</h4>
<div class="outline-text-4" id="text-org1d9ce9d">
<p>
Implement value iteration for the gambler’s problem and
solve it for ph = 0.25 and ph = 0.55. In programming, you may find it convenient to
introduce two dummy states corresponding to termination with capital of 0 and 100,
giving them values of 0 and 1 respectively. Show your results graphically, as in Figure 4.3.
Are your results stable as &theta; &rarr; 0? ⇤
</p>

<div class="org-src-container">
<pre class="src src-python">import math
import numpy as np
from matplotlib import pyplot as plt

def value_iteration(vals, actions, theta, ph):
    iters = 0
    delta = theta+1
    while delta &gt; theta or iters &lt; 256:
	iters += 1
	delta = 0
	for s in range(1, 100):
	    v = vals[s]
	    max_checkval = None
	    for bet in range(actions[s]+1):
		check_val = (ph * vals[min(100, s + bet)]) + ((1-ph) * vals[max(0, s - bet)])
		if not max_checkval or check_val &gt; max_checkval:
		    max_checkval = check_val
	    delta = max(delta, abs(v - max_checkval))
	    vals[s] = max_checkval

    policy = []

    for s in range(1,100):
	greedy_act = 0
	greedy_val = 0
	for bet in range(1, actions[s]+1):
	    q = (ph * vals[min(100, s + bet)]) + ((1-ph) * vals[max(0, s - bet)])
	    if q &gt; greedy_val:
		greedy_val = q
		greedy_act = bet

	policy.append(greedy_act)

    return policy, vals

def viz(policy, values):
    plt.plot(policy)
    plt.show()

    plt.plot(values)
    plt.show()

ph = 0.4
vals = [0 for x in range(101)]
vals[-1] = 1
actions = [x for x in range(100)]
theta = 1e-12

p_4, v_4 = value_iteration(vals, actions, theta, ph)
viz(p_4, v_4)

ph = 0.2
vals = [0 for x in range(101)]
vals[-1] = 1
actions = [x for x in range(100)]
theta = 1e-12

p_2, v_2 = value_iteration(vals, actions, theta, ph)
viz(p_2, v_2)

</pre>
</div>

<p>
Honestly, no. The value and policy both do converge, given enough timesteps, but the form they take is pretty unusual. I wonder if there are multiple optimal actions for each state, and the wild behavior of the policy is not preferring one type of state to the other? The code is pretty simple so I imagine this has to do with the problem statement, but I'm definitely left with more questions than answers. 
</p>
</div>
</div>

<div id="outline-container-org09afd6b" class="outline-4">
<h4 id="org09afd6b">Exercise 4.10</h4>
<div class="outline-text-4" id="text-org09afd6b">
<p>
What is the analog of the value iteration update (4.10) for action values,
q<sub>k+1</sub>(s, a)? ⇤
</p>

<p>
(4.10) \(v_{k+1}(s) \doteq max_a \sum_{s', r} p(s', r | s, a) [r + \gamma v_k(s')]\)
</p>

<p>
\(q_{k+1}(s, a) \doteq  \sum_{s', r} p(s', r | s, a) [r + \gamma \sum_{a'} \pi(a|s) q_k(s')]\)
</p>
</div>
</div>
</div>

<div id="outline-container-orgab5852f" class="outline-3">
<h3 id="orgab5852f"><span class="todo TODO">TODO</span> 5 - Monte Carlo Methods</h3>
<div class="outline-text-3" id="text-orgab5852f">
<p>
<i>Status: Need to do programming exercise</i>
</p>
</div>

<div id="outline-container-orgf022720" class="outline-4">
<h4 id="orgf022720">Exercise 5.1</h4>
<div class="outline-text-4" id="text-orgf022720">
<p>
Consider the diagrams on the right in Figure 5.1. Why does the estimated
value function jump up for the last two rows in the rear? Why does it drop off for the
whole last row on the left? Why are the frontmost values higher in the upper diagrams
than in the lower? ⇤
</p>

<p>
It jumps up because those are the ones you stick and often win. It drops off on the left because if the dealer has a usable ace they're more likely to win also. Frontmost values are higher in the upper diagrams because having a useable ace lets you salvage bad hands by going over 21 and looping back to a lower value.
</p>
</div>
</div>

<div id="outline-container-org76f8917" class="outline-4">
<h4 id="org76f8917">Exercise 5.2</h4>
<div class="outline-text-4" id="text-org76f8917">
<p>
Suppose every-visit MC was used instead of first-visit MC on the blackjack
task. Would you expect the results to be very different? Why or why not? ⇤
</p>

<p>
Because it also quadratically converges to v<sub>&pi;</sub> I imagine it would largely look the same. Especially because the episode lengths are very short, the only states which would be revisitable are small sums which are looped back upon with the usable ace, otherwise per-episode it should be about the same everywhere. 
</p>
</div>
</div>

<div id="outline-container-orgd561ab8" class="outline-4">
<h4 id="orgd561ab8">Exercise 5.3</h4>
<div class="outline-text-4" id="text-orgd561ab8">
<p>
What is the backup diagram for Monte Carlo estimation of q⇡? ⇤
</p>

<p>
It should look like the backup diagram on page 95, a single line representing the experience, but starting from an action instead of a state. One episode, no bootstrapping.
</p>
</div>
</div>

<div id="outline-container-orga08b617" class="outline-4">
<h4 id="orga08b617">Exercise 5.4</h4>
<div class="outline-text-4" id="text-orga08b617">
<p>
The pseudocode for Monte Carlo ES is inefficient because, for each state–
action pair, it maintains a list of all returns and repeatedly calculates their mean. It would
be more ecient to use techniques similar to those explained in Section 2.4 to maintain
just the mean and a count (for each state–action pair) and update them incrementally.
Describe how the pseudocode would be altered to achieve this. ⇤
</p>

<p>
Initialize returns as a list of tuples (0,0) instead of an empty list.
</p>

<p>
Instead of appending, add 1 to the second value and change the first value to the reward + 1 / second value times the old first value. 
</p>
</div>
</div>

<div id="outline-container-org145793e" class="outline-4">
<h4 id="org145793e">Exercise 5.5</h4>
<div class="outline-text-4" id="text-org145793e">
<p>
Consider an MDP with a single nonterminal state and a single action
that transitions back to the nonterminal state with probability p and transitions to the
terminal state with probability 1p. Let the reward be +1 on all transitions, and let
 = 1. Suppose you observe one episode that lasts 10 steps, with a return of 10. What
are the first-visit and every-visit estimators of the value of the nonterminal state? ⇤
</p>

<p>
The first-visit should be \(V(S) = G_0\) which refers to the episode reward, NOT the immediate reward. So in this case, it would be 10.
</p>

<p>
First visit it will be 10 like above. Second visit it will be 9 (since we lose the reward from the first transition). This will get added to returns which will make it [10,9], and the average is 9.5. This will continue [10,9,8,7,6,5,4,3,2,1], and the average of this is 55/10 = 5.5. 
</p>
</div>
</div>

<div id="outline-container-orgc501dc0" class="outline-4">
<h4 id="orgc501dc0">Exercise 5.6</h4>
<div class="outline-text-4" id="text-orgc501dc0">
<p>
What is the equation analogous to (5.6) for action values Q(s, a) instead of
state values V (s), again given returns generated using b? ⇤
</p>

<p>
I actually think it should be pretty much the same? We need to change \(t \in T(s)\) to be instead \(t \in T(s, a)\) but p is already in terms of the actions of each policy rather than as states, and we are doing it episode by episode which means its the same episode but in terms of the state-action transitions rather than the states alone. 
</p>
</div>
</div>

<div id="outline-container-orgac06e74" class="outline-4">
<h4 id="orgac06e74">Exercise 5.7</h4>
<div class="outline-text-4" id="text-orgac06e74">
<p>
In learning curves such as those shown in Figure 5.3 error generally decreases
with training, as indeed happened for the ordinary importance-sampling method. But for
the weighted importance-sampling method error first increased and then decreased. Why
do you think this happened? ⇤
</p>

<p>
Weighted importance sampling starts from a biased estimation and updates a ratio towards the other policy, compared to ordinary importance sampling which monotonically increases the denominator. With OIS, the variance is high that improving with more samples is much larger than the effect of having only a few samples, but with WIS, you'll likely need a few samples before it starts heading in the right direction, which could lead to a temporary increase in error.
</p>
</div>
</div>
