articles/sutton.html

<div id="outline-container-org1985ddb" class="outline-4">
<h4 id="org1985ddb">Exercise 5.8</h4>
<div class="outline-text-4" id="text-org1985ddb">
<p>
The results with Example 5.5 and shown in Figure 5.4 used a first-visit MC
method. Suppose that instead an every-visit MC method was used on the same problem.
Would the variance of the estimator still be infinite? Why or why not? ⇤
</p>

<p>
The variance would definitely still be infinite if we used an every-visit MC method. Because the importance sampling ratio is the same in both cases, each step is still 2<sup>k</sup> which is unbounded and diverging. The every-visit method will sum together averaged versions which will divide the terms by n, but that still diverges in the same way.
</p>
</div>
</div>

<div id="outline-container-org5d28e9a" class="outline-4">
<h4 id="org5d28e9a">Exercise 5.9</h4>
<div class="outline-text-4" id="text-org5d28e9a">
<p>
Modify the algorithm for first-visit MC policy evaluation (Section 5.1) to
use the incremental implementation for sample averages described in Section 2.4. ⇤
</p>

<p>
This would be done the same way as in exercise 5.4, you just replace the list with a list of tuples, and keep track of N and the running average and do the incremental average instead. 
</p>
</div>
</div>

<div id="outline-container-org398e44d" class="outline-4">
<h4 id="org398e44d">Exercise 5.10</h4>
<div class="outline-text-4" id="text-org398e44d">
<p>
Derive the weighted-average update rule (5.8) from (5.7). Follow the
pattern of the derivation of the unweighted rule (2.3). ⇤
</p>

<p>
\(V_n = \frac{\sum_{k=1}^{n-1} W_k G_k}{\sum_{k=1}^{n-1} W_k}\)
</p>

<p>
\(V_n = \frac{1}{\sum_{k=1}^{n-1} W_k} (W_{n-1} G_{n-1} + \sum_{k=1}^{n-2} W_k G_k )\)
</p>

<p>
\(V_n = \frac{1}{\sum_{k=1}^{n-1} W_k} (W_{n-1} G_{n-1} + (\sum_{k=1}^{n-2}W_k) \frac{1}{\sum_{k=1}^{n-2}W_k} \sum_{k=1}^{n-2} W_k G_k )\)
</p>

<p>
\(V_n = \frac{1}{\sum_{k=1}^{n-1} W_k} (W_{n-1} G_{n-1} + (\sum_{k=1}^{n-2}W_k) V_{n-1})\)
</p>

<p>
\(V_n = \frac{1}{\sum_{k=1}^{n-1} W_k} (W_{n-1} G_{n-1}) + \frac{1}{\sum_{k=1}^{n-1} W_k} \sum_{k=1}^{n-2}W_k V_{n-1})\)
</p>

<p>
\(V_n = \frac{1}{\sum_{k=1}^{n-1} W_k} (W_{n-1} G_{n-1}) + \frac{\sum_{k=1}^{n-2} W_k}{\sum_{k=1}^{n-1} W_k} V_{n-1})\)
</p>

<p>
\(V_n = \frac{W_{n-1}}{\sum_{k=1}^{n-1} W_k} (G_{n-1}) + \frac{\sum_{k=1}^{n-2} W_k}{\sum_{k=1}^{n-1} W_k} V_{n-1})\)
</p>

<p>
Let's introduce \(C_n = \sum_{k=1}^n W_k\)
</p>

<p>
\(V_n = \frac{W_{n-1}}{C_{n-1}} (G_{n-1}) + \frac{C_{n-2}}{C_{n-1}} V_{n-1}\)
</p>

<p>
\(V_n - V_{n-1} = \frac{W_{n-1}}{C_{n-1}} (G_{n-1}) + \frac{C_{n-2}}{C_{n-1}} V_{n-1} - V_{n-1}\)
</p>

<p>
\(V_n - V_{n-1} = \frac{W_{n-1}}{C_{n-1}} (G_{n-1}) + V_{n-1} (\frac{C_{n-2}}{C_{n-1}} - 1)\)
</p>

<p>
\(V_n - V_{n-1} = \frac{W_{n-1}}{C_{n-1}} (G_{n-1}) + V_{n-1} (\frac{C_{n-2}}{C_{n-2} + W_{n-1}} - \frac{C_{n-2}+ {W_{n-1}}}{C_{n-2} + {W_{n-1}}})\)
</p>

<p>
\(V_n - V_{n-1} = \frac{W_{n-1}}{C_{n-1}} (G_{n-1}) + V_{n-1} (\frac{C_{n-2} - C_{n-2} + {W_{n-1}}}{C_{n-2}{W_{n-1}}})\)
</p>

<p>
\(V_n - V_{n-1} = \frac{W_{n-1}}{C_{n-1}} (G_{n-1}) - V_{n-1} (\frac{W_{n-1}}{C_{n-1}})\)
</p>

<p>
\(V_n - V_{n-1} = \frac{W_{n-1}}{C_{n-1}} (G_{n-1} - V_{n-1})\)
</p>

<p>
\(V_n = V_{n-1} + \frac{W_{n-1}}{C_{n-1}} [G_{n-1} - V_{n-1}]\)
</p>
</div>
</div>

<div id="outline-container-org5c5472b" class="outline-4">
<h4 id="org5c5472b">Exercise 5.11</h4>
<div class="outline-text-4" id="text-org5c5472b">
<p>
In the boxed algorithm for off-policy MC control, you may have been
expecting the W update to have involved the importance-sampling ratio m(At|St) /
b(At|St) , but instead it involves 1 / b(At|St) . Why is this nevertheless correct? ⇤
</p>

<p>
This is because we are using W to incrementally update the importance sampling ratio, and we modify the ratio each Q assignment rather than calculating it from scratch every time.
</p>
</div>
</div>

<div id="outline-container-orgfab7460" class="outline-4">
<h4 id="orgfab7460"><span class="todo TODO">TODO</span> Exercise 5.12: Racetrack (programming)</h4>
<div class="outline-text-4" id="text-orgfab7460">
<p>
Consider driving a race car around a turn
like those shown in Figure 5.5. You want to go as fast as possible, but not so fast as
to run o↵ the track. In our simplified racetrack, the car is at one of a discrete set of
grid positions, the cells in the diagram. The velocity is also discrete, a number of grid
cells moved horizontally and vertically per time step. The actions are increments to the
velocity components. Each may be changed by +1, 1, or 0 in each step, for a total of
nine (3 ⇥ 3) actions. Both velocity components are restricted to be nonnegative and less
than 5, and they cannot both be zero except at the starting line. Each episode begins
in one of the randomly selected start states with both velocity components zero and
ends when the car crosses the finish line. The rewards are 1 for each step until the car
crosses the finish line. If the car hits the track boundary, it is moved back to a random
position on the starting line, both velocity components are reduced to zero, and the
episode continues. Before updating the car’s location at each time step, check to see if
the projected path of the car intersects the track boundary. If it intersects the finish line,
the episode ends; if it intersects anywhere else, the car is considered to have hit the track
boundary and is sent back to the starting line. To make the task more challenging, with
probability 0.1 at each time step the velocity increments are both zero, independently of
the intended increments. Apply a Monte Carlo control method to this task to compute
the optimal policy from each starting state. Exhibit several trajectories following the
optimal policy (but turn the noise off for these trajectories). ⇤
</p>

<p>
TODO
</p>
</div>
</div>

<div id="outline-container-org3f88144" class="outline-4">
<h4 id="org3f88144">Exercise 5.15</h4>
<div class="outline-text-4" id="text-org3f88144">
<p>
Make new equations analogous to the importance-sampling Monte Carlo
estimates (5.5) and (5.6), but for action value estimates Q(s, a). You will need new
notation T(s, a) for the time steps on which the state–action pair s, a is visited on the
episode. Do these estimates involve more or less importance-sampling correction?
</p>

<p>
These are pretty close to the same thing:
</p>

<p>
\(Q(s,a) = \frac{\sum_{t \in T(s,a)} p_{t:T(t)-1} G_t}{|T(s,a)|}\)
</p>

<p>
\(Q(s,a) = \frac{\sum_{t \in T(s,a)} p_{t:T(t)-1} G_t}{\sum_{t \in T(s,a)} p_{t:T(t)-1}}\)
</p>

<p>
Because these estimates already specify an action, there should be a step fewer in the total episode length compared to the state version, which should make it a little bit less correction.
</p>
</div>
</div>

<div id="outline-container-org9486461" class="outline-4">
<h4 id="org9486461"><span class="todo TODO">TODO</span> Asterisked Exercises to Revisit Later</h4>
<div class="outline-text-4" id="text-org9486461">
<p>
<b><b>These below are asterisked, so come back to them later</b></b>
</p>

<p>
Exercise 5.13 Show the steps to derive (5.14) from (5.12). ⇤
</p>

<p>
Exercise 5.14 Modify the algorithm for o↵-policy Monte Carlo control (page 111) to use
the idea of the truncated weighted-average estimator (5.10). Note that you will first need
to convert this equation to action values. ⇤
</p>
</div>
</div>
</div>

<div id="outline-container-org96ba0d4" class="outline-3">
<h3 id="org96ba0d4"><span class="todo TODO">TODO</span> 6 - Temporal-Difference Learning</h3>
<div class="outline-text-3" id="text-org96ba0d4">
<p>
<i>status: need to do programming exercises</i>
</p>
</div>
