articles/sutton.html

<div id="outline-container-org7796fcd" class="outline-4">
<h4 id="org7796fcd">Exercise 6.1</h4>
<div class="outline-text-4" id="text-org7796fcd">
<p>
If V changes during the episode, then (6.6) only holds approximately; what
would the difference be between the two sides? Let Vt denote the array of state values
used at time t in the TD error (6.5) and in the TD update (6.2). Redo the derivation
above to determine the additional amount that must be added to the sum of TD errors
in order to equal the Monte Carlo error.
</p>

<p>
We can define a new quantity
</p>

<p>
\(V_\Delta(S) = V_t(S) - V_0(S)\)
</p>

<p>
\(\delta_{t'} \doteq R_{t+1} + \gamma (V_0(S_{t+1}) + V_\Delta(S_{t+1})) - (V_0(S_t) + V_\Delta(S_t))\)
</p>

<p>
\(\delta_{t'} \doteq R_{t+1} + \gamma V_0(S_{t+1}) + V_0(S_t) + \gamma V_\Delta(S_{t+1}) + V_\Delta(S_t))\)
</p>

<p>
\(\delta_{t'} = \delta_t + \gamma V_\Delta(S_{t+1}) + V_\Delta(S_t)\)
</p>

<p>
So in turn
</p>

<p>
\(= \delta_t + \gamma \delta_{t+1} + \gamma \delta_{t+1} + ... + \gamma^{T-t-1}\delta_{T-1}\)
</p>

<p>
becomes
</p>

<p>
\(= (\delta_t + \gamma V_\Delta(S_{t+1}) + V_\Delta(S_t)) + \gamma^2 (\delta_{t+1} + \gamma V_\Delta(S_{t+2}) + V_\Delta(S_{t+1})) + ... + \gamma^{T-t-1} (\delta_{T-1} + \gamma V_\Delta(S_{T-t}) + V_\Delta(S_{T-t-1}))\)
</p>

<p>
\(= \delta_t + \gamma V_\Delta(S_{t+1}) + V_\Delta(S_t)) + \gamma^2 \delta_{t+1} + \gamma^3 V_\Delta(S_{t+2}) + \gamma^2 V_\Delta(S_{t+1})) + ... + \gamma^{T-t-1} \delta_{T-1} + \gamma^{T-t} V_\Delta(S_{T-t}) + \gamma^{T-t-1} V_\Delta(S_{T-t-1}))\)
</p>

<p>
\(=V_\Delta(S_t) + \gamma V_\Delta(S_{t+1}) + \gamma^2 V_\Delta(S_{t+2}) + \gamma^3 V_\Delta(S_{t+2}) + ... + \gamma^{T-t-1} V_\Delta(S_{T-t-1}) + \gamma^{T-t} V_\Delta(S_{T-t}) + \sum_{k=t}^{T-1} \gamma^{k-t} \delta_k\)
</p>

<p>
\(= \sum_{k=t}^{T-1} \gamma^{k-t} \delta_k + \sum_{k=t}^{T} \gamma^{k-t} V_\Delta(S_k) + \gamma^{k-t+1} V_\Delta(S_{k+1})\)
</p>

<p>
This seems pretty close, there's probably a better way
</p>
</div>
</div>

<div id="outline-container-orga0e9387" class="outline-4">
<h4 id="orga0e9387">Exercise 6.2</h4>
<div class="outline-text-4" id="text-orga0e9387">
<p>
This is an exercise to help develop your intuition about why TD methods
are often more ecient than Monte Carlo methods. Consider the driving home example
and how it is addressed by TD and Monte Carlo methods. Can you imagine a scenario
in which a TD update would be better on average than a Monte Carlo update? Give
an example scenario—a description of past experience and a current state—in which
you would expect the TD update to be better. Here’s a hint: Suppose you have lots
of experience driving home from work. Then you move to a new building and a new
parking lot (but you still enter the highway at the same place). Now you are starting
to learn predictions for the new building. Can you see why TD updates are likely to be
much better, at least initially, in this case? Might the same sort of thing happen in the
original scenario?
</p>

<p>
In the new case where you have a new final destination, an important note is that your initial path home from work is the same in both cases (getting on and off the highway in the same spots). As a result, you already know how long those time steps take, and the likely difference in total time between those states is likely to be the exact same. In TD learning, the important thing is that your early states stay similar relative to each other, and that you figure out your new trailing states. In MC methods, you need to completely update all the states to predict the final time, which resets everything since every state directly learns the resulting dynamics of everything after it.
</p>

<p>
In the original scenario, this might happen too. If a road is closed and one leg is now abnormally slow, the rest of the state value estimates might still be pretty accurate relative to each other, compared to MC methods which do not handle this type of case well.
</p>
</div>
</div>

<div id="outline-container-orgfbd9e1b" class="outline-4">
<h4 id="orgfbd9e1b">Exercise 6.3</h4>
<div class="outline-text-4" id="text-orgfbd9e1b">
<p>
From the results shown in the left graph of the random walk example it
appears that the first episode results in a change in only V(A). What does this tell you
about what happened on the first episode? Why was only the estimate for this one state
changed? By exactly how much was it changed?
</p>

<p>
It makes sense that only one state updated. The only two states that can update in TD learning with equal initialization like this are the ones next to the terminal states. The middle ones all update to \(V(S_t) + \alpha [R_{t+1} + \gamma V(S_{t+1}) - V(S_t)]\) which in this case is V(S<sub>t</sub>) + 0 + (1 * 0.5) - 0.5 which is just V(S<sub>t</sub>). The right state can update upwards, but only if the episode actually visits that state (and it can only go to one of the states. In our case here, V(A) will update to 0.5 + 0.1[0 + 1*0 - 0.5] which equals 0.45, which checks out in the diagram.
</p>
</div>
</div>

<div id="outline-container-org013b032" class="outline-4">
<h4 id="org013b032">Exercise 6.4</h4>
<div class="outline-text-4" id="text-org013b032">
<p>
The specific results shown in the right graph of the random walk example
are dependent on the value of the step-size parameter, &alpha;. Do you think the conclusions
about which algorithm is better would be affected if a wider range of &alpha; values were used?
Is there a different, fixed value of &alpha; at which either algorithm would have performed
significantly better than shown? Why or why not? 
</p>

<p>
For this problem it makes sense that TD methods are more sample efficient. MC methods rely heavily upon the fact that you can arrive at the value of the state after sampling lots of episode returns and averaging them for each state. TD methods will instead increment based on the estimates of surrounding states, which makes it more like a combination of DP methods and MC methods. I can imagine that there are very unwise alpha values for which TD methods may fail to converge, though, for example if &alpha; = 1, V(A) in our last example would be assigned a new value of 0, which seems bad. In this case, MC methods would still be making updates based on the total returns, while TD methods only get to consider adjacent states, which might make them more likely to diverge instead of converge.
</p>
</div>
</div>

<div id="outline-container-org1405b97" class="outline-4">
<h4 id="org1405b97">Exercise 6.6</h4>
<div class="outline-text-4" id="text-org1405b97">
<p>
In Example 6.2 we stated that the true values for the random walk example
are 1/6, 2/6, 3/6, 4/6, and 5/6, for states A through E. Describe at least two different ways that
these could have been computed. Which would you guess we actually used? Why?
</p>

<p>
I probably would have used value iteration, where we can repeatedly improve the estimates until they converged. You could also use monte carlo methods starting from each state and averaging the return, which would also be pretty easy and would arrive at these values in the limit.
</p>
</div>
</div>

<div id="outline-container-org7070018" class="outline-4">
<h4 id="org7070018">Exercise 6.8</h4>
<div class="outline-text-4" id="text-org7070018">
<p>
Exercise 6.8 Show that an action-value version of (6.6) holds for the action-value form
of the TD error &delta;<sub>t</sub> = Rt+1 + &gamma; Q(St+1, At+1) - Q(St, At), again assuming that the values
don’t change from step to step.
</p>

<p>
\(G_t - Q(S_t, A_t) = R_{t+1} + \gamma G_{t+1} - Q(S_t, A_t) + \gamma Q(S_{t+1}, A_{t+1}) - \gamma Q(S_{t+1}, A_{t+1})\)
</p>

<p>
\(= \delta_t + \gamma(G_{t+1} - Q(S_{t+1}, A_{t+1}))\)
</p>

<p>
\(= \delta_t + \gamma \delta_{t+1}+ \gamma^2(G_{t+2} - Q(S_{t+2}, A_{t+2}))\)
</p>

<p>
\(= \delta_t + \gamma \delta_{t+1}+ ... + \gamma^{T-t}(G_{T} - Q(S_{T}, A_{T}))\)
</p>

<p>
\(= \delta_t + \gamma \delta_{t+1}+ ... + \gamma^{T-t}(0 - 0)\)
</p>

<p>
\(= \sum_{k=t}^{T-1} \gamma^{k-t} \delta_k\)
</p>

<p>
Thankfully this is the same, since Q(S<sub>T</sub>, A<sub>T</sub>) and G<sub>T</sub> are both still 0.
</p>
</div>
</div>

<div id="outline-container-org46277dc" class="outline-4">
<h4 id="org46277dc"><span class="todo TODO">TODO</span> Exercise 6.9 (programming)</h4>
<div class="outline-text-4" id="text-org46277dc">
<p>
Re-solve the windy
gridworld assuming eight possible actions, including the diagonal moves, rather than four.
How much better can you do with the extra actions? Can you do even better by including
a ninth action that causes no movement at all other than that caused by the wind?
</p>
</div>
</div>
