org/articles/sutton.org
**** TODO Exercise 6.10 (programming)

Exercise 6.10: Stochastic Wind (programming) Re-solve the windy gridworld task with
King’s moves, assuming that the effect of the wind, if there is any, is stochastic, sometimes
varying by 1 from the mean values given for each column. That is, a third of the time
you move exactly according to these values, as in the previous exercise, but also a third
of the time you move one cell above that, and another third of the time you move one
cell below that. For example, if you are one cell to the right of the goal and you move
left, then one-third of the time you move one cell above the goal, one-third of the time
you move two cells above the goal, and one-third of the time you move to the goal. ⇤

**** Exercise 6.11

Why is Q-learning considered an /off-policy/ control method?

Q-learning is considered an off-policy control method because it directly approximates the optimal action-value function but doesn't use that function to actually select actions to perform this calculation. This makes it different from Sarsa, which will use the Q value of the action actually taken from S_{t+1}, compared to Q learning which performs the update using the maximum Q value available from S_{t+1} (even if it decides to do something else)

**** Exercise 6.12

Suppose action selection is greedy. Is Q-learning then exactly the same
algorithm as Sarsa? Will they make exactly the same action selections and weight
updates?

If action selection is greedy, then $max_a Q(S_{t+1}, a) = Q(S_{t+1}, A_{t+1})$, meaning Sarsa and Q-learning are the same. The difference here is that if you want to add an exploratory policy, Sarsa would use that policy to update, but Q-learning would use the same greedy action selection regardless of what action is actually taken. Note: this also assumes that ties are broken the same way. If they differ then obviously they are no longer the same, but I'm assuming from the way the question is asked that this means "if the actions are always the same"

**** Exercise 6.14

Describe how the task of Jack’s Car Rental (Example 4.2) could be
reformulated in terms of afterstates. Why, in terms of this specific task, would such a
reformulation be likely to speed convergence?

In Jack's Car Rental, your "move" is how many cars you move from location A to location B (which can be negative, if you want to move cars from B to A). The "opponent move" is how many cars get added or subtracted from each location (i.e. from rentals and returns).

In this situation, you will often arrive at the same number of cars in both locations even if all of these numbers vary a lot (i.e. I have 0 and 3, I move -1 to get 1 and 2, location A has 1 return, location B has 1 rental, leading to 2 and 1. This is the same, for example, as starting with 2 and 1, doing 0 moves, and having 3 rentals and 3 returns in each situation). The number of possible paths spirals out to a dramatically high number (since many values can vary) but the actual resulting states is limited to just that 20x20 box, so framing it as the resulting number before doing the update is much more likely to lead to fast convergence since you'll be able to cross-learn from different situations.

**** TODO Asterisked Exercises to Return To Later

Exercise 6.5 In the right graph of the random walk example, the RMS error of the
TD method seems to go down and then up again, particularly at high ↵’s. What could
have caused this? Do you think this always occurs, or might it be a function of how the
approximate value function was initialized?

Exercise 6.7 Design an off-policy version of the TD(0) update that can be used with
arbitrary target policy \pi and covering behavior policy b, using at each step t the importance
sampling ratio pt:t (5.3).

Exercise 6.13 What are the update equations for Double Expected Sarsa with an
\epsilon -greedy target policy?

*** (In Progress) 7 - n-step Bootstrapping

/Status: Need to do programming/

**** Exercise 7.1

In Chapter 6 we noted that the Monte Carlo error can be written as the
sum of TD errors (6.6) if the value estimates don’t change from step to step. Show that
the n-step error used in (7.2) can also be written as a sum of TD errors (again if the
value estimates don’t change) generalizing the earlier result.

Recall the TD Error

$\delta_t \doteq R_{t+1} + \gamma V(S_{t+1}) - V(S_t)$

The n-step error here is the bracketed part of 7.2:

$V_{t+n}(S_t) \doteq V_{t+n-1}(S_t) + \alpha [G_{t:t+n} - V_{t+n-1}(S_t)]$

Since the values won't change we can just write it as V from now on.

The n-step return is:

$G_{t:t+n} = R_{t+1} + \gamma R_{t+2} + ... + \gamma^{n-1} R_{t+n} + \gamma^n V(S_{t+n})$

$G_{t:t+n} - V(S_t) = R_{t+1} + \gamma R_{t+2} + ... + \gamma^{n-1} R_{t+n} + \gamma^n V(S_{t+n}) - V(S_t)$

For this last step, we can add and subtract the same values like so:

$G_{t:t+n} - V(S_t) = R_{t+1} + \gamma R_{t+2} + ... + \gamma^{n-1} R_{t+n} + \gamma^n V(S_{t+n}) + \gamma^{n-1} V(S_{t+n-1}) - \gamma^{n-1} V(S_{t+n-1}) + ... - V(S_t)$

Rearranging we get

$G_{t:t+n} - V(S_t) = R_{t+1} + \gamma V(S_{t+1}) - V(S_t) + R_{t+2} + \gamma^2 V(S_{t+2}) - \gamma V(S_{t+1}) + ... + R_{t+n} + \gamma^n V(S_{t+n}) - \gamma^{n-1} V(S_{t+n-1})$

Which is

$G_{t:t+n} - V(S_t) = \delta_t + \gamma \delta_{t+1} + ... + \gamma^{n-1} \delta_{t+n}$

$G_{t:t+n} - V(S_t) = \sum_{k=t}^{t+n} \gamma^{k-1} \delta_k$

**** TODO Exercise 7.2 (programming)

With an n-step method, the value estimates do change from step to
step, so an algorithm that used the sum of TD errors (see previous
exercise) in place of the error in (7.2) would actually be a slightly
di↵erent algorithm. Would it be a better algorithm or a worse one?
Devise and program a small experiment to answer this question
empirically.

**** Exercise 7.3

Why do you think a larger random walk task (19 states instead of 5) was
used in the examples of this chapter? Would a smaller walk have shifted the advantage
to a different value of n? How about the change in left-side outcome from 0 to -1 made
in the larger walk? Do you think that made any difference in the best value of n?

With a shorter random walk task, it takes fewer n for your n-step method to pretty much be a MC method (barring the very unlikely extremes, which are truncated). It seems unlikely that you'd get as interesting separation in this experiment compared to the version with the longer walk. The left-side value being -1 seems unlikely to make too much of a difference, since we initialize halfway between the two values and update towards or away from one of the endpoints in both cases. But since it's higher magnitude in both directions, it might propogate higher values farther for larger values of n? It seems unlikely to change the dynamics much though, as written.

