articles/sutton.html

<div id="outline-container-org57aef90" class="outline-4">
<h4 id="org57aef90">Exercise 7.4</h4>
<div class="outline-text-4" id="text-org57aef90">
<p>
Prove that the n-step return of Sarsa (7.4) can be written exactly in terms
of a novel TD error
</p>

<p>
\(G_{t:t+n} \doteq R_{t+1} + \gamma R_{t+2} ... + \gamma^{n-1} R_{t+n} + \gamma^n Q_{t+n-1}(S_{t+n}, A_{t+n})\)
</p>

<p>
\(G_{t:t+n} \doteq \gamma^n Q_{t+n-1}(S_{t+n}, A_{t+n}) + \sum_{k=t}^{t+n} \gamma^{k-t }R_{k+1}\)
</p>

<p>
We use that plus minus trick again
</p>

<p>
\(G_{t:t+n} \doteq \gamma^n Q_{t+n-1}(S_{t+n}, A_{t+n}) + \gamma^{n-1} Q_{t+n-1}(S_{t+n-1}, A_{t+n-1}) - \gamma^{n-1} Q_{t+n-1}(S_{t+n-1}, A_{t+n-1}) + ... + \sum_{k=t}^{t+n} \gamma^{k-t }R_{k+1}\)
</p>

<p>
Then we can pull everything except the last Q<sub>t-1</sub>(S<sub>t</sub>, A<sub>t</sub>) into the sum
</p>

<p>
\(G_{t:t+n} = Q_{t-1}(S_t, A_t) + \sum_{k=t}^{min(t+n, T)-1} \gamma^{k-t} [R_{k+1} + \gamma Q_k(S_{k+1}, A_{k+1}) - Q_{k-1}(S_k, A_k)]\)
</p>
</div>
</div>

<div id="outline-container-orga652932" class="outline-4">
<h4 id="orga652932">Exercise 7.11</h4>
<div class="outline-text-4" id="text-orga652932">
<p>
 Show that if the approximate action values are unchanging, then the
tree-backup return (7.16) can be written as a sum of expectation-based TD errors
</p>

<p>
\(\delta_t \doteq R_{t+1} + \gamma \bar{V}_t(S_{t+1}) - Q(S_t, A_t)\)
</p>

<p>
\(\bar{V}_t(s) \doteq \sum_a \pi(a|s)Q_t(s, a)\)
</p>

<p>
(7.16) \(G_{t:t+n} \doteq R_{t+1} + \gamma \sum_{a \neq A_{t+1}} \pi(a|S_{t+1})Q(S_{t+1}, a) + \gamma \pi(A_{t+1}|S_{t+1})G_{t+1:t+n}\)
</p>

<p>
let's rewrite \(\bar{V}\) in terms of this weird action sum we're doing
</p>

<p>
\(\bar{V}_t(s) \doteq \pi(s, A_{t+1})Q(s,A_{t+1}) + \sum_{a \neq A_{t+1}} \pi(a|s)Q_t(s, a)\)
</p>

<p>
And therefore
</p>

<p>
\(\sum_{a \neq A_{t+1}} \pi(a|s)Q_t(s, a) = \bar{V}_t(s) - \pi(A_{t+1}|s)Q(s,A_{t+1})\)
</p>

<p>
so
</p>

<p>
\(G_{t:t+n} \doteq R_{t+1} + \gamma \bar{V}_t(S_{t+1}) - \gamma \pi(A_{t+1}|S_{t+1})Q(S_{t+1}, A_{t+1}) + \gamma \pi(A_{t+1}|S_{t+1})G_{t+1:t+n}\)
</p>

<p>
Let's observe that
</p>

<p>
\(\delta_t + Q(S_t, A_t) \doteq R_{t+1} + \gamma \bar{V}_t(S_{t+1})\)
</p>

<p>
So we can simplify
</p>

<p>
\(G_{t:t+n} \doteq \delta_t + Q(S_t, A_t) - \gamma \pi(A_{t+1}|S_{t+1})Q(S_{t+1}, A_{t+1}) + \gamma \pi(A_{t+1}|S_{t+1})G_{t+1:t+n}\)
</p>

<p>
\(G_{t:t+n} \doteq \delta_t + Q(S_t, A_t) + \gamma \pi(A_{t+1}|S_{t+1})[G_{t+1:t+n} - Q(S_{t+1}, A_{t+1})]\)
</p>

<p>
\(G_{t:t+n} \doteq \delta_t + Q(S_t, A_t) + \gamma \pi(A_{t+1}|S_{t+1})[[\delta_{t+1} + Q(S_{t+1}, A_{t+1}) + \gamma \pi(A_{t+2}|S_{t+2})[G_{t+2:t+n} - Q(S_{t+2}, A_{t+2})] - Q(S_{t+1}, A_{t+1})]\)
</p>

<p>
Distribute it back in
</p>

<p>
\(G_{t:t+n} \doteq \delta_t + Q(S_t, A_t) + \gamma \pi(A_{t+1}|S_{t+1})[\delta_{t+1} + Q(S_{t+1}, A_{t+1}) + \gamma \pi(A_{t+2}|S_{t+2})[G_{t+2:t+n} - Q(S_{t+2}, A_{t+2})] - \gamma \pi(A_{t+1}|S_{t+1})Q(S_{t+1}, A_{t+1})]\)
</p>

<p>
\(G_{t:t+n} \doteq \delta_t + Q(S_t, A_t) + \gamma \pi(A_{t+1}|S_{t+1})\delta_{t+1} + \gamma \pi(A_{t+1}|S_{t+1})Q(S_{t+1}, A_{t+1}) + \gamma \pi(A_{t+1}|S_{t+1})\gamma \pi(A_{t+2}|S_{t+2})[G_{t+2:t+n} - Q(S_{t+2}, A_{t+2})] - \gamma \pi(A_{t+1}|S_{t+1})Q(S_{t+1}, A_{t+1})\)
</p>

<p>
\(G_{t:t+n} \doteq \delta_t + Q(S_t, A_t) + \gamma \pi(A_{t+1}|S_{t+1})\delta_{t+1} + \gamma \pi(A_{t+1}|S_{t+1})\gamma \pi(A_{t+2}|S_{t+2})[G_{t+2:t+n} - Q(S_{t+2}, A_{t+2})]\)
</p>

<p>
Rewrite it, note that the product over an empty index set is 1.
</p>

<p>
\(G_{t:t+n} \doteq Q(S_t, A_t) + \prod_{i=t+1}^{t}\gamma\pi(A_i, S_i)\delta_t + \prod_{i=t+1}^{t+1}\gamma\pi(A_i, S_i) \delta_{t+1} + \prod_{i=t+1}^{t+2}\gamma\pi(A_i, S_i)[Q(S_{t+2}, A_{t+2}) + G_{t+2:t+n}]]\)
</p>

<p>
Expand out until terminal n (or terminal state)
</p>

<p>
\(G_{t:t+n} = Q(S_t, A_t) + \sum_{k=t}^{min(t+n-1, T-1)} \delta_k \prod_{i=t+1}^{k} \gamma \pi(A_i|S_i)\)
</p>
</div>
</div>

<div id="outline-container-orgb7752d7" class="outline-4">
<h4 id="orgb7752d7"><span class="todo TODO">TODO</span> Starred Exercises</h4>
<div class="outline-text-4" id="text-orgb7752d7">
<p>
This section is a bit odd &#x2013; Chapter 7 has 5 exercises in section 7.4, which is a starred section. One of these exercises is starred, the rest are not. I'm treating these exercises as starred, and the starred exercise as double-starred, but that might be wrong?
</p>

<p>
Exercise 7.5 Write the pseudocode for the off-policy state-value prediction algorithm
described above. (This one isn't technically starred? But it's in a starred section, so I'll put it here)
</p>

<p>
Exercise 7.6 Prove that the control variate in the above equations does not change the
expected value of the return. ⇤
</p>

<p>
(double-starred) Exercise 7.7 Write the pseudocode for the off-policy action-value prediction algorithm
described immediately above. Pay particular attention to the termination conditions for
the recursion upon hitting the horizon or the end of episode. ⇤
</p>

<p>
Exercise 7.8 Show that the general (off-policy) version of the n-step return (7.13) can
still be written exactly and compactly as the sum of state-based TD errors (6.5) if the
approximate state value function does not change. ⇤
</p>

<p>
Exercise 7.9 Repeat the above exercise for the action version of the off-policy n-step
return (7.14) and the Expected Sarsa TD error (the quantity in brackets in Equation 6.9).
⇤
</p>

<p>
Exercise 7.10 (programming) Devise a small off-policy prediction problem and use it to
show that the off-policy learning algorithm using (7.13) and (7.2) is more data efficient
than the simpler algorithm using (7.1) and (7.9). ⇤
</p>
</div>
</div>
</div>

<div id="outline-container-org688a1aa" class="outline-3">
<h3 id="org688a1aa"><span class="todo TODO">TODO</span> 8 - Planning and Learning with Tabular Methods</h3>
<div class="outline-text-3" id="text-org688a1aa">
<p>
<i>status: need to do programming, answers are all pretty vague right now.</i>
</p>
</div>

<div id="outline-container-org00bd23a" class="outline-4">
<h4 id="org00bd23a">Exercise 8.1</h4>
<div class="outline-text-4" id="text-org00bd23a">
<p>
The nonplanning method looks particularly poor in Figure 8.3 because it is
a one-step method; a method using multi-step bootstrapping would do better. Do you
think one of the multi-step bootstrapping methods from Chapter 7 could do as well as
the Dyna method? Explain why or why not.
</p>

<p>
It's pretty similar conceptually but probably still worse here since in dyna you don't just get n steps updated, you also update the state closest to the goal n times.
</p>
</div>
</div>

<div id="outline-container-org714ccf6" class="outline-4">
<h4 id="org714ccf6">Exercise 8.2</h4>
<div class="outline-text-4" id="text-org714ccf6">
<p>
Why did the Dyna agent with exploration bonus, Dyna-Q+, perform
better in the first phase as well as in the second phase of the blocking and shortcut
experiments?
</p>

<p>
Encouraging it to explore means it's more likely to correct errors in the model
</p>
</div>
</div>

<div id="outline-container-org3ffe98c" class="outline-4">
<h4 id="org3ffe98c">Exercise 8.3</h4>
<div class="outline-text-4" id="text-org3ffe98c">
<p>
Careful inspection of Figure 8.5 reveals that the di↵erence between Dyna-Q+
and Dyna-Q narrowed slightly over the first part of the experiment. What is the reason
for this?
</p>

<p>
When the models are correct, encouraging it to do extra exploration provides minimal value over doing more exploitation, which is done in Dyna-Q more than Dyna-Q+.
</p>
</div>
</div>

<div id="outline-container-org05ead35" class="outline-4">
<h4 id="org05ead35"><span class="todo TODO">TODO</span> Exercise 8.4 (programming)</h4>
<div class="outline-text-4" id="text-org05ead35">
<p>
The exploration bonus described above actually changes
the estimated values of states and actions. Is this necessary? Suppose the bonus \(k \sqrt{t}\)
was used not in updates, but solely in action selection. That is, suppose the action
selected was always that for which Q(St, a) + \(k \sqrt{t(S_t, a)}\) was maximal. Carry out a
gridworld experiment that tests and illustrates the strengths and weaknesses of this
alternate approach.
</p>
</div>
</div>
