org/articles/sutton.org
**** Exercise 8.5

How might the tabular Dyna-Q algorithm shown on page 164 be modified
to handle stochastic environments? How might this modification perform poorly on
changing environments such as considered in this section? How could the algorithm be
modified to handle stochastic environments and changing environments?

Replace (e) with a table of state transitions and rewards, and instead of just taking from it you sample from it instead. This might perform poorly because you'll take a long time to notice changes in the environment, since you'll just have to keep updating until the new change dwarfs the old one, so to make it handle changing environments you could keep a sort of running table of the most recent $k$ visits to that state, instead of every one, which will naturally kill off information from older visits.

**** Exercise 8.6

The analysis above assumed that all of the b possible next states were
equally likely to occur. Suppose instead that the distribution was highly skewed, that
some of the b states were much more likely to occur than most. Would this strengthen or
weaken the case for sample updates over expected updates? Support your answer.

Would probably strengthen; in the case where you have a lot of very unlikely successor states you waste a lot of potential calculating expectations compared to sampling, which will more directly explore the more likely trajectories much more often. 

**** Exercise 8.7

Some of the graphs in Figure 8.8 seem to be scalloped in their early portions,
particularly the upper graph for b = 1 and the uniform distribution. Why do you think
this is? What aspects of the data shown support your hypothesis?

A very noteworthy thing about the scalloping in the graphs is that they all happen at the same time for each plot, regardless of whether it's using on-policy or uniform. This would suggest that it's not related to which of those it's using, but that it affects the latter much more in evaluation. 

**** TODO Exercise 8.8 (programming)

Replicate the experiment whose results are shown in the
lower part of Figure 8.8, then try the same experiment but with b = 3. Discuss the
meaning of your results. 

*** 9 - On-policy Prediction with Approximation

9 exercises: 1 starred

*** 10 - On-policy Control with Approximation

9 exercises

*** 11 - *Off-policy Methods with Approximation

4 exercises: 1 programming, 2 starred

*** 12 - Eligibility Traces

14 exercises: 1 starred

*** 13 - Policy Gradient Methods

5 exercises: 1 starred

*** 14-16: No Exercises

*** 17 - Frontiers

1 exercise

