articles/sutton.html

<div id="outline-container-orgebeb80a" class="outline-4">
<h4 id="orgebeb80a">Exercise 8.5</h4>
<div class="outline-text-4" id="text-orgebeb80a">
<p>
How might the tabular Dyna-Q algorithm shown on page 164 be modified
to handle stochastic environments? How might this modification perform poorly on
changing environments such as considered in this section? How could the algorithm be
modified to handle stochastic environments and changing environments?
</p>

<p>
Replace (e) with a table of state transitions and rewards, and instead of just taking from it you sample from it instead. This might perform poorly because you'll take a long time to notice changes in the environment, since you'll just have to keep updating until the new change dwarfs the old one, so to make it handle changing environments you could keep a sort of running table of the most recent \(k\) visits to that state, instead of every one, which will naturally kill off information from older visits.
</p>
</div>
</div>

<div id="outline-container-org83653df" class="outline-4">
<h4 id="org83653df">Exercise 8.6</h4>
<div class="outline-text-4" id="text-org83653df">
<p>
The analysis above assumed that all of the b possible next states were
equally likely to occur. Suppose instead that the distribution was highly skewed, that
some of the b states were much more likely to occur than most. Would this strengthen or
weaken the case for sample updates over expected updates? Support your answer.
</p>

<p>
Would probably strengthen; in the case where you have a lot of very unlikely successor states you waste a lot of potential calculating expectations compared to sampling, which will more directly explore the more likely trajectories much more often. 
</p>
</div>
</div>

<div id="outline-container-org2417be7" class="outline-4">
<h4 id="org2417be7">Exercise 8.7</h4>
<div class="outline-text-4" id="text-org2417be7">
<p>
Some of the graphs in Figure 8.8 seem to be scalloped in their early portions,
particularly the upper graph for b = 1 and the uniform distribution. Why do you think
this is? What aspects of the data shown support your hypothesis?
</p>

<p>
A very noteworthy thing about the scalloping in the graphs is that they all happen at the same time for each plot, regardless of whether it's using on-policy or uniform. This would suggest that it's not related to which of those it's using, but that it affects the latter much more in evaluation. 
</p>
</div>
</div>

<div id="outline-container-org41b5b9f" class="outline-4">
<h4 id="org41b5b9f"><span class="todo TODO">TODO</span> Exercise 8.8 (programming)</h4>
<div class="outline-text-4" id="text-org41b5b9f">
<p>
Replicate the experiment whose results are shown in the
lower part of Figure 8.8, then try the same experiment but with b = 3. Discuss the
meaning of your results. 
</p>
</div>
</div>
</div>

<div id="outline-container-org4d87fb0" class="outline-3">
<h3 id="org4d87fb0">9 - On-policy Prediction with Approximation</h3>
<div class="outline-text-3" id="text-org4d87fb0">
<p>
9 exercises: 1 starred
</p>
</div>
</div>

<div id="outline-container-org07b1967" class="outline-3">
<h3 id="org07b1967">10 - On-policy Control with Approximation</h3>
<div class="outline-text-3" id="text-org07b1967">
<p>
9 exercises
</p>
</div>
</div>

<div id="outline-container-org1338b70" class="outline-3">
<h3 id="org1338b70">11 - *Off-policy Methods with Approximation</h3>
<div class="outline-text-3" id="text-org1338b70">
<p>
4 exercises: 1 programming, 2 starred
</p>
</div>
</div>

<div id="outline-container-orgd91dc01" class="outline-3">
<h3 id="orgd91dc01">12 - Eligibility Traces</h3>
<div class="outline-text-3" id="text-orgd91dc01">
<p>
14 exercises: 1 starred
</p>
</div>
</div>

<div id="outline-container-org4faa107" class="outline-3">
<h3 id="org4faa107">13 - Policy Gradient Methods</h3>
<div class="outline-text-3" id="text-org4faa107">
<p>
5 exercises: 1 starred
</p>
</div>
</div>

<div id="outline-container-org0577026" class="outline-3">
<h3 id="org0577026">14-16: No Exercises</h3>
</div>

<div id="outline-container-orgee2c96c" class="outline-3">
<h3 id="orgee2c96c">17 - Frontiers</h3>
<div class="outline-text-3" id="text-orgee2c96c">
<p>
1 exercise
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
